{"overall": 3.0, "verified": true, "reviewTime": "04 6, 2017", "reviewerID": "A2P2EJ6SG8PAK8", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "Craig Barker", "reviewText": "So great one liners in this movie, but not as good as I had remembered.  Sometimes you should just let the memory roll on.", "summary": "Hmmm.", "unixReviewTime": 1491436800}
{"overall": 4.0, "verified": true, "reviewTime": "01 24, 2016", "reviewerID": "A1064205QOBO19", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Very satisfied with the service, VERY dissapointed with\nthe movie. I'm talking about the quality of the movie.\nIt's boring. Peter O'Toole aparently did it for the money.", "summary": "Good service, bad movie", "unixReviewTime": 1453593600}
{"overall": 5.0, "verified": true, "reviewTime": "11 16, 2015", "reviewerID": "A5E3H5F6DAJ5F", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "Daniel J. Gainsboro", "reviewText": "Great movie! Fun for everyone. Well acted, interesting story line and well worth the price.", "summary": "Mind expanding movie", "unixReviewTime": 1447632000}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "08 19, 2015", "reviewerID": "A34EY7MQR6QFRA", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "A Time Traveler", "reviewText": "\"The Player\" seems to be considered the go-to film about the film industry, possibly because so many dozens of big-name actors appeared in it. To a point, I agree that it does shed some light on an oft-misunderstood industry. To a lesser extent \"Barton Fink\" (a small-timer trying to make it in the olden days) and \"The Artist\" (how the industry operated during more imaginative days) are also pretty informative films about how matters are sorted outside the view of the public concerning film, but you could also apply it (to an extent) to other aspects of entertainment.\n\n\"The Stunt Man\" easily trumps all, but deceptively so. The reason why I say \"deceptively,\" is mainly because the film is given a slightly campy overlay that contributes to the whirl of activity surrounding the making of the film. At the eye of this storm is director Eli Cross, played perfectly (as usual) by Peter O'Toole. O'Toole is depicted on most publicity posters for this film as satan and for good reason. Cross manipulates every angle and aspect of the film he is making and takes the extra step of delving into motivating and tempting the actors off screen as well. In other words, what he \"wants\" to get out of them, he achieves. He gets them to do it, no matter how corrupting it is to their morals, no matter how recklessly-dangerous it is to their safety and no matter how far over line he must prod producers to go budget-wise.\n\nYes, \"The Stunt Man\" is a deceptively-accurate look into what the most highly acclaimed directors do to get the most out of their cast & crew.", "summary": "Probably the Best-Disguised Film About the Movie Industry", "unixReviewTime": 1439942400}
{"overall": 4.0, "verified": true, "reviewTime": "02 2, 2009", "reviewerID": "A3CUFZAL76NM5P", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "Torrlisand67", "reviewText": "real sharp beautiful detail. great extras. if you enjoy classic 50's sci-fi you will enjoy owning this disc.", "summary": "classic sci-fi 1950's", "unixReviewTime": 1233532800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "01 12, 2009", "reviewerID": "A2O0SB1EVNGCRB", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "brutus2011", "reviewText": "This classic b&w sci-fi movie in blu-ray is spectacular...anyone who doubts how much better blu-ray is compared to regular dvd media needs to see this one!", "summary": "Better in Blu-Ray", "unixReviewTime": 1231718400}
{"overall": 4.0, "verified": true, "reviewTime": "11 9, 2015", "reviewerID": "ATLPIKQ2QZZ73", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Julia", "reviewText": "Its Lucy and Desi...nuf said! :)", "summary": "Four Stars", "unixReviewTime": 1447027200}
{"overall": 5.0, "verified": true, "reviewTime": "10 26, 2015", "reviewerID": "A2MCP11XKLR3W7", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Orlando Medeiros", "reviewText": "Great!", "summary": "Five Stars", "unixReviewTime": 1445817600}
{"overall": 5.0, "verified": true, "reviewTime": "10 12, 2015", "reviewerID": "A12E2GLT5AHM6L", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Shundra", "reviewText": "Love it Got them used because it was cheaper and they came perfect they look new! I just love them all good classic movies. From my favorite couple!!!!!", "summary": "Must have!!!!! For Lucy&Desi fans", "unixReviewTime": 1444608000}
{"overall": 2.0, "verified": true, "reviewTime": "08 9, 2015", "reviewerID": "A1EV68RUVVW03F", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Ty M", "reviewText": "I have always loved Lucille Ball. But this movie was not one of her best. The story had great value about love and commitment. But the elements just didn't come together.", "summary": "Just didn't make it.", "unixReviewTime": 1439078400}
{"overall": 5.0, "verified": true, "reviewTime": "03 22, 2017", "reviewerID": "A16VVA8G48M5UP", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Dr. D. Rossbach", "reviewText": "Fast-paced and very entertaining classic.", "summary": "Enjoyable ride", "unixReviewTime": 1490140800}
{"overall": 5.0, "verified": true, "reviewTime": "03 15, 2017", "reviewerID": "A2WY9TIHI88GHN", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Sheri Hyatt", "reviewText": "Great movie!!", "summary": "Five Stars", "unixReviewTime": 1489536000}
{"overall": 5.0, "verified": true, "reviewTime": "03 12, 2017", "reviewerID": "A32UOH8TFSVRZ5", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Glen Johnson", "reviewText": "works great", "summary": "Five Stars", "unixReviewTime": 1489276800}
{"overall": 5.0, "verified": true, "reviewTime": "03 9, 2017", "reviewerID": "A1UL9FTY7YX93N", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "mgw", "reviewText": "Great movie, it's a classic.", "summary": "Five Stars", "unixReviewTime": 1489017600}
{"overall": 1.0, "verified": true, "reviewTime": "03 1, 2017", "reviewerID": "A1ERFRG5DT2654", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "starr cooper", "reviewText": "It won't play in the United States.", "summary": "These people suck... PS Awesome movie", "unixReviewTime": 1488326400}
{"overall": 5.0, "verified": true, "reviewTime": "07 21, 2015", "reviewerID": "A31FZDLHGXW9WS", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Daniel Thomas", "reviewText": "Don't know what else to say but that Peter O'Toole is fantastic and that I love this movie which I originally saw in a movie theater. Something not many people did. RIP Alex Rocco who died the day I wrote this review.", "summary": "\"Hey Bert, it's amazing you're still alive, considering who you are working for.\"", "unixReviewTime": 1437436800}
{"overall": 1.0, "verified": true, "reviewTime": "07 9, 2015", "reviewerID": "AYP94T31OHAOZ", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "Cindy Garner", "reviewText": "The sound was really bad with this film.  I actually could not hear it well enough to rate accurately.", "summary": "Bad sound", "unixReviewTime": 1436400000}
{"overall": 4.0, "verified": true, "reviewTime": "06 25, 2015", "reviewerID": "A28BCMMC6UX3TN", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Jf", "reviewText": "I have always enjoyed this film over the years. Peter O'toole was wonderful as a director of a film within a film. Lots of twists and turns . Great cast", "summary": "A must see if only for its shots at film industry", "unixReviewTime": 1435190400}
{"overall": 3.0, "verified": true, "reviewTime": "06 16, 2015", "reviewerID": "A3HL3ZQ8A3JH8O", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Michael E. Nader", "reviewText": "Okay---so I rated it merely \"Okay,\" but nonetheless you should watch it if only to see Peter O'Toole in action, how he is a control freak, a gamesman, a conniver.  Yeah, you may even like it a lot more than I did and if so I'd be convinced a rated it too low.", "summary": "you may even like it a lot more than I did and if ...", "unixReviewTime": 1434412800}
{"overall": 5.0, "verified": true, "reviewTime": "05 29, 2015", "reviewerID": "A1P3X9NFU6YDFB", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Brian", "reviewText": "Quite simply a tour de force performance by Peter O'Toole as a \"do what it takes to get done\" movie director.  One of his best roles, right up there with \"Lawrence of Arabia\".", "summary": "O'Toole Shines", "unixReviewTime": 1432857600}
{"overall": 5.0, "verified": true, "reviewTime": "02 28, 2015", "reviewerID": "AUCRSGYS6581Z", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Sharon M. Harold", "reviewText": "One of the good ones! Holds your interest.  One of  O'Toole's best.", "summary": "Five Stars", "unixReviewTime": 1425081600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "01 11, 2009", "reviewerID": "A2FU1SVV7FZ2WT", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "E. D. Deuss", "reviewText": "Where to begin on this sparkling 2-disc version of the 1951 hit, \"The Day the Earth Stood Still\"? The nicest thing about the film itself (apart from the gorgeous print) was the 5.1 surround sound. Heard thru a decent speaker system, it's really very well done.\n\nThe only thing I felt was unnecessary was the inclusion of the trailer for the '08 (and only adequate) version of the film. (If they had put it at the end of the film, I would have no objections, nor will I probably ever take a look at this '08 film. I have too much respect for the '51 film to see the other version.)\n\nThe extras are well done, with a couple of interviews with surviving cast members, an audio reading of the Harry Bates short story that inspired the film, and a couple of \"how we did it\" short flms.\n\nIn short, this is the ONE version to have. I got rid of my previous DVD when I saw this one.", "summary": "First Class \"Day\"", "unixReviewTime": 1231632000}
{"overall": 5.0, "verified": true, "reviewTime": "01 7, 2009", "reviewerID": "A22TLTZF4CPJDY", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Marty Oster", "reviewText": "This upgraded DVD is sensational for the purest. Every detail is covered and the film looks better than ever - this is the \"Mona Lisa\" of early sci-fi and should never have been redone. Always a favorite and definitely a watch again film.", "summary": "Original \"Day The Earth Stood Still\"", "unixReviewTime": 1231286400}
{"overall": 5.0, "verified": false, "reviewTime": "01 6, 2009", "reviewerID": "AD0J5KK4WQXNS", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "OverTheMoon", "reviewText": "I suppose with the remake showing this is as good a time as any to watch the original classic again. In fact this timeless film demands to be watched again and again. The premise is simple and yet profound. An alien visitor that looks human arrives on Earth to give Earth's people a message about the future of mankind; however political red-tape and our own personal problems prevent him from delivering the message because he needs to assemble World leaders for it to happen and they just can't because of divisions. So instead he shows a sign by making all machinery stop around the world for a limited amount of time and in doing so this causes the military to kill him. It's an essential piece for any movie collection and the moral to the message doesn't change and still matters today. There are also a lot of religious undercurrent themes (such as bodily resurrection, miracles and signs) but in the context of a highly developed race with advanced technology that should amuse the scientifically-minded.", "summary": "I come in peace", "unixReviewTime": 1231200000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 1, 2009", "reviewerID": "A38ZTUNQJVGP6S", "asin": "6302168465", "style": {"Format:": " VHS Tape"}, "reviewerName": "Michael Patrick Boyd", "reviewText": "The Day the Earth Stood Still is one hour and thirty-two minutes and was released in theaters on September 28, 1951. The movie plays like an antiwar movie. The basic storyline is that a spaceship from two-hundred and fifty miles away lands in President's Park, in Washington, D.C. and a human like alien and giant robot appears. Klaatu, the alien appears and while reaching for a gift for the president, he is shot by soldier. Klaatu is taken to a hospital and later escapes from it. Klaatu moves into a border house so he can study the people of Earth. At the house he befriends a young boy named Bobby. Bobby gives Mr. Carpenter, Klaatu, a tour of Washington, D.C. One of the stops is at Arlington National Cemetery where Mr. Carpenter is distraught to learn that the people in the graves died mostly from past wars. The two pay a visit to the home of Professor Jacob Barnhardt and Mr. Carpenter goes over Professor Barnhardt math\\physics formula and makes a correction. Before the two leave Mr. Carpenter leave his address with the housekeeper so Professor Barnhardt can call on him. A federal agent comes to the boarding house and collects Mr. Carpenter to take him to Professor Barnhardt's home. Mr. Carpenter reveals to Professor Barnhardt that he is Klaatu. Klaatu asks Professor Barnhardt to gather a group of international scientists at his spaceship so he can give them a message to take back to their governments. Professor Barnhardt asks Klaatu to give a demonstration of his technology but to harm no one in the process. Klaatu manages to sneak back on his ship set up the demonstration. The next day all the electricity across the world shuts down for a half hour with the exception of hospitals and planes in flight. The United States government and army go on a manhunt for Klaatu. Klaatu is shot in the back while trying to make it back to his spaceship. Before he is shot he tells Helen these famous words: \"Klaatu barada nikto\". Helen must say these words to Gort, the alien giant robot, or Gort might just scorch Earth. Gort retrieves Klaatu and takes him back to the spaceship where he is bought back to life. Klaatu leaves a message to the people of saying if you bring your warlike ways to our galaxy, we will scorch your Earth and all life on it will be killed or you can choose peace. The choice is yours and we will be waiting for your answer. If look in the beginning of movie you will notice Frances Bavier in her movie debut. Frances Bavier is better known as Aunt Bee in the Andy Griffith Show. Also this was Michael Rennie (Klaatu\\Mr. Carpenter) first leading role and top billing role as well. The Day the Earth Stood Still gets an AAAAA+++++.", "summary": "Great Science Fiction Movie", "unixReviewTime": 1230768000}
{"overall": 5.0, "verified": false, "reviewTime": "12 30, 2008", "reviewerID": "A96K1ZGW56S2I", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "tvtv3", "reviewText": "Though released almost sixty years ago in 1951, THE DAY THE EARTH STOOD STILL is a sci-fi and cinema classic that still holds up incredibly well. The film has had a huge impact upon popular culture and many elements in the film, e.g. the groundbreaking score, are now staples of the sci-fi genre.\n\nThe movie opens with worldwide warnings of an object hurling towards Earth. The object turns out to be a spaceship that lands in a field in Washington, D.C. The military, police officers, emergency personnel, and casual spectators surround the ship to see what will happen. A door opens in the spacecraft and a human-like creature walks out. The creature claims to come in peace and begins to take out a device from his suit. A fearful soldier shoots the creature and he falls to the ground wounded. From the spaceship a giant robot, named Gort, emerges and proceeds to destroy all the weapons in the area. He stops at the alien's command. The robot freezes and no one is able to move him from his place. Meanwhile, the alien is taken to a hospital. It is learned that the alien's name is Klaatu and he has come to Earth to deliver a vital message to the leaders of the world. Unfortunately, the world is an imperfect place and many of the world's leaders refuse to come to Washington, D.C. to hear what Klaatu has to say. So, he takes things into his own hands and escapes from the hospital. Very few people know what Klaatu looks like and he is able to blend in with the populace. He takes up residence at a local boarding house and takes the name of Mr. Carpenter. Klaatu attempts to complete his mission, but also befriends Helen Benson (Patricia Neal), a widowed mother, and her son, Bobby (Billy Gray).\n\nThough some modern viewers might find THE DAY THE EARTH STOOD STILL quaint, the film was exceptionally well done. The movie is notable for it's memorable images, e.g. Gort chasing after Helen Benson, and groundbreaking score by Bernard Herrman (the movie was one of the first to use theremins, an instrument that soon became common place in sci-fi musical scores). The movie withstood the test of time to become a classic piece of filmmaking and science fiction, it still holds up incredibly well today. Not only that, but despite not having many of the particulars that audiences seem to clamor for today: tons of special effects, excessive violence, gratuitous sexuality, etc.; the movie can still captivate an audience. In short, it's a film that people of all ages and from all walks of life can watch and enjoy today. \"Klaatu barada nikto.\" And for those of you with a keen eye, look for Frances Bavier (best known as Aunt Bea on THE ANDY GRIFFITH SHOW) as Mrs. Barley, one of the residents of the boarder house that Klaatu moves into.\n\nThe DVD includes all kinds of extra features including a commentary by Robert Wise, a 70-minute documentary entitled \"Making the Earth Stand Still\", a Movietone Newsreel that includes a spot with Gort, restoration comparatives between the original film and restored versions of the movie, still galleries, the shooting script, original theatrical trailer, and trailers for ONE MILLION YEARS B.C. and JOURNEY TO THE CENTER OF THE EARTH. I particularly enjoyed the \"Making the Earth Stand Still\" documentary. I learned a great deal about the movie that I had never known or thought about before. For instance, though the parallels are rather apparent, I had never picked up on the Christian allegorical elements of the film. I also found it fascinating that Lock Martin, the giant of a man who portrayed Gort, was rather feeble.", "summary": "Classic Sci-fi Film That Is Still Relevant", "unixReviewTime": 1230595200}
{"overall": 5.0, "verified": true, "reviewTime": "01 29, 2015", "reviewerID": "A365IJBFTYYGNJ", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Sean", "reviewText": "Gift for my father.  One of O'Toole's best performances.  You can both love and loathe the character he played.  His talents are certainly missed.", "summary": "great film", "unixReviewTime": 1422489600}
{"overall": 5.0, "verified": false, "reviewTime": "01 20, 2015", "reviewerID": "A3QE2M2HTYQU2C", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "D. Scott Apel", "reviewText": "This review is an excerpt from my book \"Killer B's: The 237 Best Movies On Video You've (Probably) Never Seen,\" which is available as an ebook on Amazon. If you enjoy this review, there are 236 more like it in the book (plus a whole lot more). Check it out!\n\nTHE STUNT MAN: \"If God could do the tricks that we can do, He'd be a happy man!\" proclaims Eli Cross--a film director reputedly based on John Huston (who, perhaps not coincidentally, played a character named \"Noah Cross\" in Chinatown a few years earlier). Like Huston, director Eli engages in shameless manipulation, pushes everyone to the edge, and gets away with murder--here, perhaps literally.\n\nEli's philosophy is that reality depends on your point of view--as long as it's his. The film follows his lead, daring us to guess whether it's \"real\" real or \"reel\" real. There's plenty of comic action in the film-within-the-film, the occasional brilliant line, intense emotional revelations, levels of deception that add depth to everyone's story, and a number of flagrant \"fooled-ya\" stunt sequences to feed our need for illusion and belief.", "summary": "A Real \"Killer\" B Movie (one of 237!)", "unixReviewTime": 1421712000}
{"overall": 4.0, "verified": true, "reviewTime": "09 11, 2014", "reviewerID": "AFRYCHMSVZHRO", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "Steven G. Zunich", "reviewText": "Awesome. Had not seen it since it was in the theaters back in the eighties. Great film with great performances by Peter O'Toole, Steven Railsback and Barbara Hershey!!", "summary": "Great film!", "unixReviewTime": 1410393600}
{"overall": 5.0, "verified": false, "reviewTime": "08 18, 2014", "reviewerID": "A88B9ITZDUFQK", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "onemanforall", "reviewText": "One of my favorite films of all time. Great performance by all actors, especially by Barbara Hershey. The film is about an eccentric and idealistic filmmaker (O'Toole) who sets out to make an anti-war movie in the years following Vietnam through the use of drama, satire and tragedy. His character is conflicted, unappreciated, at times, egocentric and insane and one never knows to just what degree he would go to illustrate his point through the eyes of an eccentric and creative artist. he is often misunderstood, shunned and yet admired and loved all throughout the film. His relationship with the stunt man is at times one of mentor and pupil as well as two strangers who speak very different languages (figuratively) and try to find a common ground. Love the storyline!", "summary": "A great classic from the 80's", "unixReviewTime": 1408320000}
{"overall": 4.0, "verified": true, "reviewTime": "08 18, 2014", "reviewerID": "A3IFVFOTUIK581", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "minetwo", "reviewText": "good movie had to have it", "summary": "Four Stars", "unixReviewTime": 1408320000}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2017", "reviewerID": "AJOWWZNQIM9NM", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Jason", "reviewText": "This movie really passes the test of time, still a great movie to watch!", "summary": "Friggin Classic!", "unixReviewTime": 1487635200}
{"overall": 5.0, "verified": false, "reviewTime": "02 10, 2017", "reviewerID": "A2SP52NH44LRDS", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Amazon Customer", "reviewText": "I can't believe it's been since 1992 that I saw this movie.  Even the 2015 remake is awesome.", "summary": "Awesome action movie and great story.", "unixReviewTime": 1486684800}
{"overall": 5.0, "verified": true, "reviewTime": "02 10, 2017", "reviewerID": "AE8DZ5JZNRTIO", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Brenda", "reviewText": "Great movie", "summary": "Five Stars", "unixReviewTime": 1486684800}
{"overall": 5.0, "verified": true, "reviewTime": "07 23, 2015", "reviewerID": "A2MGSZJP4Q79S2", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Sheila Lazarus", "reviewText": "I bought this series mostly to get the movie \"The Long Long Trailer.\"  I saw this movie years ago (not when it originally came out) and I loved it.  It's so hysterical.  If you've ever been camping you will get a kick out of this movie.  They didn't show this movie again for years and then when it came out on DVD I had to have it.  They rarely show it on TV.  I never get tired of watching it.  i also like the other movies that came in this collection.", "summary": "\" I saw this movie years ago (not when it originally came out) and I loved it. It's so hysterical", "unixReviewTime": 1437609600}
{"overall": 5.0, "verified": true, "reviewTime": "06 8, 2015", "reviewerID": "AQXG8FJANG281", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Just my opinion", "reviewText": "I still love Lucy", "summary": "Cute movie.", "unixReviewTime": 1433721600}
{"overall": 5.0, "verified": true, "reviewTime": "05 24, 2015", "reviewerID": "A25268ORWBK3UW", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "sg", "reviewText": "If your a Lucille Ball fan like I am you will really enjoy this movie. Lucy and Desi are terrific, I almost like this movie better than The Long Long trailer!", "summary": "If your a Lucille Ball fan like I am you will really enjoy this movie", "unixReviewTime": 1432425600}
{"overall": 5.0, "verified": true, "reviewTime": "04 16, 2015", "reviewerID": "A1MPPCHBJ8TG91", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Camille Almonte", "reviewText": "Like this movie alot, anything with lucille ball and Desi Arnaz makes a good addition to my I love lucy collection.", "summary": "Like this movie alot", "unixReviewTime": 1429142400}
{"overall": 5.0, "verified": true, "reviewTime": "01 15, 2017", "reviewerID": "A2H6216E9QWALB", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "john", "reviewText": "Way better then the remake\nThe look and feel of the movie represents the time and place very well..\nGreat fun...blueray is awesome", "summary": "Awesome movie!!", "unixReviewTime": 1484438400}
{"overall": 5.0, "verified": false, "reviewTime": "01 14, 2017", "reviewerID": "ACWNOIUIARKUE", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "A.S.", "reviewText": "Great!", "summary": "Five Stars", "unixReviewTime": 1484352000}
{"overall": 5.0, "verified": true, "reviewTime": "01 14, 2017", "reviewerID": "A37H4Z5YAD6PPQ", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "rhea witchie", "reviewText": "great", "summary": "Five Stars", "unixReviewTime": 1484352000}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2017", "reviewerID": "A26TJTN6GHF4GP", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Capo2", "reviewText": "You know what you're getting..... it's like a time capsule!! it does what it says it's going to do.... not everything has to be Citizen Kane.. just 90 minutes, or so, of escapism... enjoy!", "summary": "it's like a time capsule", "unixReviewTime": 1484179200}
{"overall": 5.0, "verified": true, "reviewTime": "01 9, 2017", "reviewerID": "A14VQV6C3IQBZV", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Avid Reader", "reviewText": "A great movie, every single time.", "summary": "Five Stars", "unixReviewTime": 1483920000}
{"overall": 5.0, "verified": true, "reviewTime": "01 6, 2017", "reviewerID": "APYAZQMTHNSA1", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Matthew F. Niner", "reviewText": "Awesome.", "summary": "Five Stars", "unixReviewTime": 1483660800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 12, 2014", "reviewerID": "A3E03DOMMQORYI", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Peter M", "reviewText": "One of my all time favourite American films. Truly  unforgettable in everyway. A masterpiece.", "summary": "Five Stars", "unixReviewTime": 1407801600}
{"overall": 5.0, "verified": false, "reviewTime": "07 10, 2014", "reviewerID": "A2QLXTFWE7G4J1", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Mark Davis", "reviewText": "Very happy with purchase.", "summary": "Five Stars", "unixReviewTime": 1404950400}
{"overall": 5.0, "verified": true, "reviewTime": "06 25, 2014", "reviewerID": "A2VFXOYDGLMZNF", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "GMAC", "reviewText": "Droll, clever, and full of plot twists and turns. What's not to like about this movie?  Peter O'Toole is delicious as Eli, the movie director, who may be evil or good, or just plain playful. A young military veteran (Steve Railsback) who probably has untreated PTSD, is on the run from the law after an incident in an ice cream store.  He ends up amid the filming of a WWI morality tale. Eli hires him to replace a stuntman who was accidentally killed on the set.  As a stuntman, he doesn't know if he will live to see another day.  He has become romantically involved with Eli's former girlfriend and female lead in the movie, played by Barbara Hershey.  He thinks that Eli will kill him during a car stunt on a bridge because of his romantic poaching.  Will he or won't he?  It's worth the viewing to discover.", "summary": "Great underrated movie", "unixReviewTime": 1403654400}
{"overall": 5.0, "verified": false, "reviewTime": "05 14, 2014", "reviewerID": "AXOZ5BWOEDL76", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Amazon Customer", "reviewText": "THE STUNT MAN [1980] [Blu-ray] A Virtuoso Piece Of Moviemaking! Peter OToole Gives A Peerless Comic Performance!\n\nIt defied all odds to become the most unexpected and acclaimed cult hit of the 80s, and it remains one of the most slyly subversive and thrillingly original action/comedy/drama motion pictures of all time. The legendary Peter OToole in his iconic Oscar nominated performance stars as director Eli Cross, a deliciously megalomaniacal madman commanding a film-set circus where a paranoid young veteran [Steve Railsback] finds himself maybe replacing a dead stunt man, possibly falling for the beautiful leading lady [Barbara Hershey], and discovering that love, death and the mayhem of moviemaking can definitely be the wildest illusions of all. THE STUNT MAN now features a stunning High Definition transfer supervised by Oscar nominated Producer/Director Richard Rush, plus new interviews and commentaries with Rush, Peter OToole, Steve Railsback and Alex Rocco, all in the ultimate edition of the classic that the Los Angeles Times calls as innovative today as Citizen Kane was in its time! \"If God could do the tricks that we can do, he'd be a happy man.\"\n\nFILM FACT: Awards and Nominations: Academy Awards: Nominated: Best Actor for Peter O'Toole. Nominated: Best Director for Richard Rush. Nominated: Best Adapted Screenplay for Lawrence B. Marcus, Richard Rush. Montreal World Film Festival: Win: \"Grand Prix des Am&eacute;riques\" Best Film for Richard Rush. Win: Golden Globe Awards: Best Original Score for Dominic Frontiere. Win: National Society of Film Critics Awards: Best Actor for Peter O'Toole. Peter O'Toole mentions in his DVD commentary that he based his character on David Lean who directed him in Lawrence of Arabia.\n\nCast: Peter O'Toole, Steve Railsback, Barbara Hershey, Allen Garfield, Alex Rocco, Sharon Farrell, Adam Roarke, Philip Bruns, Charles Bail, John Garwood, Jim Hess, John Pearce, Michael Railsback, George Wallace, Dee Carroll, Leslie Winograde, Don Kennedy, Whitey Hughes, Walter Robles, A.J. Bakunas, Roberto Caruso, Frank Avila, Stafford Morgan, Jack Palinkas, James Garrett, Garrett McPherson, Nelson Tyler, Louis Gartner, William Joseph Arno (uncredited), James Avery (uncredited), Frank Beetson (uncredited), Gregg Berger (uncredited), Chance Boyer (uncredited), Deanna Dae Coleman (uncredited), Larry Dunn  (uncredited), Don Hayden (uncredited), Patricia McPherson (uncredited), Ross Reynolds (uncredited), Gordon Ross (uncredited), Marion Wayne (uncredited) and Leigh Webb (uncredited)\n\nDirector: Richard Rush\n\nProducers: Melvin Simon, Paul Lewis and Richard Rush\n\nScreenplay: Lawrence B. Marcus, Richard Rush and Paul Brodeur (novel)\n\nComposer: Dominic Frontiere\n\nCinematography: Mario Tosi\n\nVideo Resolution: 1080p\n\nAspect Ratio: 1.85:1\n\nAudio: English: 5.1 DTS-HD Master Audio and English: 2.0 Dolby Digital\n\nSubtitles: None\n\nRunning Time: 131 minutes\n\nRegion: All Regions\n\nNumber of discs: 1\n\nStudio: 20th Century Fox / SEVERIN Films\n\nAndrews Blu-ray Review: Cameron [Steve Railsback] didn't exactly have stars in his eyes when he broke into the film industry. No, he was instead simply on the run from the cops. Why...? That's a story for later, seeing as how he's too busy darting through the woods to talk about that quite yet. Just when Cameron thinks he's in the clear, some sixty-something-year-old sedan car, a relic from World War One tries to run him down? In a fit of desperation, Cameron sends the car careening off the bridge, and both it and the driver trapped inside plummet deep, deep, deep into the water below. When a helicopter soars upward a fraction of a second later, Cameron fully expects that the police have caught up to him, but...no. Inside are a smartly dressed British director and a massive 35mm camera. Eli Cross [Peter O'Toole] is in town filming his WWI epic, and completely fascinated by this wild young man, he sees an opportunity. Eli knows this fugitive wants to keep out of sight, and what better place to hide than among a sprawling film crew? A quick shave, a job title, and the word of an authoritarian director ought to silence any suspicions. Of course, Cameron's going to have to earn his keep. The shoot is down one stunt man, thanks to him, so who better to fill the vacancy than Cam? At first, everything appears to be going swimmingly. Cameron ducked tracer fire in Vietnam for two years straight, so squibs and jumps and rolls don't have him breaking a sweat. Cameron is clearly the teacher's pet, he has a gorgeous starlet by the name of Nina Franklin [Barbara Hershey] writhing all over him, and he gets $600 a pop for every stunt he pulls off. The only thing is that he starts to feel less like a stunt man on the set of a multimillion motion picture and more like a guinea pig being nudged through some deranged scientist's maze. As the lines between reality and illusion continue to blur, Cameron can't quite shake the feeling that Eli Cross is trying to capture his death on film.\n\nTHE STUNT MAN defies description. Like so many of the greatest films hailing from the 1970s, it's a collision of the commercial and wildly artistic. Someone who was only halfway paying attention could still take THE STUNT MAN as a popcorn film, with soldiers frantically exchanging gunfire, dogfights mid-air, dizzyingly acrobatic leaps, cars careening off bridges, a couple of sex scenes, even more explosions, and an honest-to-God love interest for good measure. It's a film at least in part about the stuntmen who risk life and limb to make movies feel like such an adrenaline rush and jumping open drawbridges, Tarzan like swinging from a vine...you know the song, so of course it's thrilling in its own right. THE STUNT MAN is infused with a manic energy that never relents, propelled further by an outstanding score, a wicked sense of humour, a brilliant cast led by the legendary Peter O'Toole, and endlessly quotable dialogue. Nothing about THE STUNT MAN fits cleanly into any prefabricated box. Is it a comedy? A drama? An action flick? Well...yes and all that and more.\n\nVirtually every moment throughout THE STUNT MAN unfolds through Cameron's eyes, someone from the outside whose thrust in the middle of this insanity and the audience is right there with him, every bit as disoriented as he is. There is no clear distinction between illusion and reality. Cameron never knows if his life is truly in danger or if it's all part of the show. Perspectives shift wildly. One moment, Cameron may be doing the Charleston however many thousands of feet in the air on the wing of a biplane, with the full ascent documented and Eli Cross following close behind in a helicopter, and then the camera will pull back to show he's on a carefully wired rig a dozen or so feet off the ground. Reality is so fluid throughout THE STUNT MAN film that is not possible to get a firm grasp on it, and that's one of the most incredible things about the film. You're never ahead of the movie. You, the audience, are also at the mercy of a masterfully manipulative storyteller. Richard Rush bombards the screen with one strange, surreal, hyperkinetic, explosive set piece after another, and the many allusions drawn to Alice in Wonderland throughout are wholly deserved. Simply put, THE STUNT MAN stands strong as one of the most ambitious, uncompromising, and devilishly clever films ever made.\n\nTHE STUNT MAN approaches a career best for Peter O'Toole, which, for an actor of his stature, is saying something. He portrays Eli Cross as a god of sorts. The film set is a world of his creation, and to the cast and crew that march in lockstep with his every command, Eli Cross's word is Holy Scripture. He's often in a different plane than the rest of the cast of THE STUNT MAN, often descending from the heavens in a crane that doesn't appear to be attached to anything. Every utterance of Peter O'Toole's is unforgettable, and the balance he strikes between impishly charming and understatedly terrifying is outstanding. Steve Railsback is inspired casting in the part of a man being driven mad by Eli Cross's machinations. Just a couple years before cameras rolled, Steve Railsback had starred as Charles Manson in Helter Skelter, and few actors can play raving and unhinged as skilfully as he can. Barbara Hershey is alluring and elusive as an actress who's spent so much of her young life pretending to be other people that she doesn't know who she is or what she wants. The list goes on from there.\n\nIn the same way that the character Cameron is never really sure he can trust what he's seeing, I'm having a hard time believing that The Stunt Man truly has found its way to Blu-ray. For a film with three key Academy Awards nominations, endless critical praise, and a rabidly fierce fan base, THE STUNT MAN isn't the easiest film to wrap one's hands around. It never escaped into more than a handful of cinemas in America. Even close to a full decade after the film finally hit the Anchor Bay DVD, and that's with a hundred thousand copies in circulation. SEVERIN Films knows how much hunger there is for THE STUNT MAN and not only have they brought this brilliant film to the awesome Blu-ray format, but they've put together a definitive release to go along with it. Essentially all of the extras from the limited edition Anchor Bay DVD set have been carried over; including an audio commentary and a feature-length documentary and SEVERIN Films has also assembled close to two hours' worth of new extras as well. Very, very highly recommended!\n\nBlu-ray Video Quality  THE STUNT MAN isn't glossy, gleaming high definition eye candy, but if it were, that'd mean something went terribly wrong. This Blu-ray disc is gloriously grainy, just as it should be. Aside from a few scattered soft shots that date back to the original photography, the presentation is so much sharper and more teeming with detail than I waltzed in expecting to see. There's some speckling, sure, but its light enough not to distract all that much. There's no trace of edge enhancement or excessive noise reduction. Its palette is much punchier than that faded inferior DVD from a decade back, and contrast is more robust as well, not looking quite so soupy and thin. SEVERIN Films Blu-ray disc also exposes a little bit more information. Instead of me just talking about how much better the THE STUNT MAN looks in high definition compared to Anchor Bay's limited edition DVD, then you must purchase the Blu-ray disc to find out for yourself. The significant change in colour timing could be a little controversial, but for whatever my vote's worth, the saturation on the Blu-ray disc looks better to my eyes. The disc's packaging confirms that the transfer was supervised by Richard Rush as well, so clearly it has the director's thumbs-up. If there's one misstep that SEVERIN Films has made here, it's up converting a couple hours worth of standard definition extras to 1080i. That needlessly gobbles up a lot of space that a film this gritty and grainy really needs. To make room for the pointlessly up converted extras, the 131 minute film is rendering of the film grain suffers as a result. I can't help but think more adept compression may have brought out at least a little more detail as well. For a case-in-point, look at how the grain clumps together and looks so excessively digital in the screenshot below.\n\nBlu-ray Audio Quality  Though the only soundtrack on this Blu-ray disc is a 5.1 DTS-HD Master Audio remix, it's respectful to the original sound design. The mix is weighted towards the front speakers, with effects like police sirens, whirring helicopter blades, biplanes soaring overhead, a sudden rush of water, and why not? Nazi-era chanting spilling into the surrounds. The pans across the soundstage aren't completely silky smooth, but they're effective enough. Bass response is solid when called for, such as the rumble of a motorcade and more than a couple of explosions. The score by Dominic Frontiere sounds particularly impressive, rendered with a fidelity and robustness that I never would've expected to hear. Dialogue and other sound effects don't pack quite as much of a wallop, but they emerge well enough. It does seem that the dialogue is dialled a touch lower in the mix than I would've liked, although I can't say I ever missed a line. This is a worthy remix and a strong showing overall.\n\nBlu-ray Special Features and Extras:\n\nAudio Commentary: Commentary with writer-director Richard Rush, along with stars Peter O'Toole, Steve Railsback, Barbara Hershey, Alex Rocco, Sharon Farrell and Chuck Bail: This THE STUNT MAN commentary track is a little easy to miss since it's only listed under \"Audio Setup\" and isn't mentioned at all under \"Extras.\" It is well-worth those extra couple of clicks, though, showcasing a massive array of talent: Richard Rush, Peter O'Toole, Steve Railsback, Barbara Hershey, Alex Rocco, Sharon Farrell, and Chuck Bail. The commentary is pieced together from several different sessions, but there's still a good bit of interaction between the different speakers. There are no shortage of highlights here, including why the bookending classic car footage is sped up, Rush filming other people filming, unbeknown to them, which of the many directors Peter O'Toole has worked with over the years bears the greatest similarity to Eli Cross, director Richard Rush doubling as a hairdresser, the title of the film-within-a-film, and paying guests staying at the resort where planes were swooping down from overhead and WWI soldiers were shooting everything to holy hell. This audio commentary is overflowing with personality, and it's such an infectiously fun listen and well-worth setting aside the time to hear this superb audio commentary.\n\nSpecial Feature: The Sinister Saga: The Making of The Stunt Man [114 minutes] Don't think of The Sinister Saga as an extra; instead, look at this Blu-ray disc as a double feature. A lot of making-of documentaries are content to just aim cameras at talking heads, but Richard Rush is too visually inventive and has far too keen a sense of humour to settle for that. Rush is very much the star of his own film this time around, and he's constantly on the move as he tells the story of how THE STUNT MAN came together, be it zooming up a towering glass elevator, running 35mm film through the projector in his screening room, revisiting the resort where so much of the film was shot, or soaring however many tens of thousands of feet up in the air. The Documentary is teeming with crackling clever transitions, and rather than just cut away to an excerpt from THE STUNT MAN, he'll...oh, I don't know, overlay it on the wing of an airplane. The Sinister Saga is just such a blast to watch, and it's made even better by the fact that the story that the documentary tells is every bit as fascinating. Richard Rush does a tremendous job setting the stage: an era where the concept of making a film about a stunt man was unfathomable, and where no studio in town wanted to bite on a project as uncommercial as that novel One Flew Over the Cuckoos Nest he'd also gotten the rights to produce. Screenwriting, financing, casting, and the score are all explored in great detail...and always with several intriguingly insane stories to go along with them. Those walls being knocked down by the WWI-era tank...? That's the M-G-M back lot as it was prepped for demolition. All of the key members of the cast get a chance to contribute too, including Peter O'Toole who notes that a madman like Eli Cross wouldn't last a minute in this industry. Rush delves into how he pioneered what'd go on to be known as rack focus, his struggles with producers hell-bent on sabotaging THE STUNT MAN, and how changes in the business made lining up a distributor so nightmarish, and how he ultimately had to shoulder so much of the film's promotion himself. The Sinister Saga might have been the first feature-length making-of documentary I'd ever watched when I first saw it ten years ago, and even with the thousand or so reviews I've churned out in the decade since, I don't think I've ever come across another one that can touch it as this is totally essential viewing.\n\nSpecial Feature: The Maverick Career of Richard Rush [1080p] [34:00] Director Richard Rush delves in impressive detail into every one of the movies in his filmography, including making his debut with the teen abortion film Too Soon to Love, calling in the Hell's Angels to fend off vengeful San Franciscan hippies during the production of Psych-Out, mashing together a biker flick and cowboys-and-Indians with The Savage Seven, and his press war that spun out of the debacle with The Color of Night. It's not a straight ahead career retrospective, and Rush has a knack for finding at least one fascinating, completely unexpected story to tell about each of the films he's helmed over the years.\n\nSpecial Feature: Peter O'Toole Recounts THE STUNT MAN [1080p] [19:00] I'm sure it goes without saying that by far the highlight of the newly-produced extras is this interview with Peter O'Toole. He weaves a number of tremendous stories while looking back on THE STUNT MAN, including how getting the boot from his girlfriend put him on the path to starring in Richard Rush's film, the crossroads he was at as a middle-aged actor, mimicking an oblivious Richard Rush on the set while bringing the character of Eli Cross to life, pulling a prank on an actor who dozed off in the middle of the shoot, and how torrential rain and impatient producers threatened the filming of the films bookending sequences.\n\nSpecial Feature: Devil's Squadron: An Interview with Steve Railsback and Alex Rocco [1080p] [19:00] Real-life best friends Steve Railsback and Alex Rocco met on the set of The Stunt Man, and the two of them tell stories of Peter O'Toole reciting hyper vulgar renditions of Shakespeare to ducks, a symphony of dicks that once caught Steve Railsback off-guard on the other side of the camera, the huge names that Richard Rush turned down in favour of his preferred cast, a prank Rush pulled on the producers to show how serious he was about keeping his final cut, and the incredible critical reception of the film. Being such close friends and all, Steve Railsback and Alex Rocco also poke a lot of good-hearted fun at each other and talk about what their friendship has meant over the years.\n\nSpecial Feature: Barbara Hershey on Nina Franklin [1080p] [14:00] This terrific conversation with Barbara Hershey begins with a discussion about what makes THE STUNT MAN in general and the character of Nina in particular so uniquely intriguing. Hershey dissects Nina as best anyone can for a character that in so many ways is elusive, and she also marvels about working alongside Peter O'Toole, particularly a genuine burst of emotion that was captured on film.\n\nSpecial Feature: The Stunt Man at the New Beverly [1080p] [17:00] Following a screening of the film, Richard Rush, Steve Railsback, and Barbara Hershey field questions from the audience. The three of them speak about how faithful the finished film is to the original screenplay, whether or not Richard Rush and Eli Cross have all that much in common, the excruciatingly long process of lining up a distributor, what it's like to work alongside a living legend like Peter O'Toole, and how warmly European audiences received the film. The casting of 'THE STUNT MAN and the structure of its story are also discussed.\n\nDeleted Scenes [1080p] [6:00] The first of The Stunt Man's two deleted scenes sees Eli slumping down on a pile of sand, his thumb in his mouth, while Sam gabs about how the once-brilliant screenplay he'd penned is losing its relevancy over time. The second scene has a gaggle of the film's crew turning a police station into a horn ball version of the Keystone Kops. It's worth noting that a third deleted scene is included exclusively as a part of The Sinister Saga of Making The Stunt Man.\n\nTheatrical Trailers [1980] [1080p] Here included are the Teaser Trailer, Theatrical Trailer and Spanish Trailer of the Original Theatrical Trailers for the THE STUNT MAN.\n\nSEVERIN Films Trailers [480i] Inglorious Bastards, Shopping and Santa Sangre [sadly they are all of such terrible quality].\n\nFinally, in the end, THE STUNT MAN is a totally amazing entertaining examination of perception and paranoia of the film industry. To me it is the essential classic film of its genre and is definitely well worth purchasing. There is so much to enjoy. This film has extensive layers and seems to have been overlooked by some of the major critics as the delightful cornucopia of adventure/love/escape that it offers viewers. The movie-within-a-movie themes are explored in kind of an abstract way that end up being both amusing and addictive. It has 'cult status' written all over it. The Blu-ray is an impressive package. A lot of love went into this edition and it makes for a very desirable purchase. We endorse! That is why it has gone in pride of place in my Blu-ray Collection and is totally awesome for any collector of brilliant intelligent character driven films and has been a massive favourite of mine ever since I had the Anchor Bay Special Edition DVD and now having it in the Blu-ray format, has given me the ultimate edition and will always give me many hours of entertaining viewing. Very Highly Recommended!\n\nAndrew C. Miller  Your Ultimate No. 1 Film Fan\nLe Cinema Paradiso\nWARE, United Kingdom", "summary": "THE STUNT MAN [1980] [Blu-ray]", "unixReviewTime": 1400025600}
{"overall": 4.0, "verified": true, "reviewTime": "05 12, 2014", "reviewerID": "A1NSXRQW4EFRQJ", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "g", "reviewText": "Saw this back in the day and enjoyed Perter O'toole and his crazy comedic adventure. Its no Gone with the wind nor 7 samarai and is dated but its good fun -  especially if you like Peter O'toole.  Nobody exudes the kind of power and charisma that peter the great does !.....As 4 the video quality I would categorize it as Fair and acceptable, nothing more. and I doubt getting the blue ray would help the quality much.  If your at least somewhat of a movie buff and hunting 4 more out of the mainstream movies I recommend stuntman. If your unfamiliar with Peter O'tooles work and want 2 see the better of it than I recommend Lawrence of Arabia / Lion in winter or one of my personal favorites -Becket(with Richard Burton). The product arrived ok and all that", "summary": "Review 4 dvd version of stuntman", "unixReviewTime": 1399852800}
{"overall": 5.0, "verified": false, "reviewTime": "12 28, 2008", "reviewerID": "A1FNW6H983I87V", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Loves To Read", "reviewText": "This classic science fiction, the defining film of the genre for many people, is about a humanoid that travels 250,000,000 miles from another planet with a message for the people of our planet. He lands in Washington, D.C. with his guardian robot and attempts to connect with world leaders to make his message known. There is mistrust by those in power of someone they are unfamiliar with and powers they have not seen before. They are not willing to give him the opportunity to speak so he must attempt to get his message out through other channels. Are there people who will listen to his message of how to prevent Planet Earth from self destructing or being destroyed from outside forces? Will anyone take him seriously? You have to remember that this was made during the height of the Cold War and nuclear war was on the radar screen of almost every citizen. Watch the newsreel that coincides with the release of the movie to see what was going on in the world at that time and it will help to put the movie into context. While there is action and some violence this is also a movie of relationships and how people react to something/someone they're not familiar with. A classic still worth watching today with good entertainment value as well as plenty of food for thought. [...]", "summary": "A MESSAGE FOR TODAY, ALSO!!", "unixReviewTime": 1230422400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 27, 2008", "reviewerID": "A3F0TGIDHH9D78", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "Lianytsur", "reviewText": "The movie is one of those that is just a relevant today as when made.  The special effects are still those of the 1950's but still a great watch.  This is the original in B&W.", "summary": "Stood the Test of Time", "unixReviewTime": 1230336000}
{"overall": 4.0, "verified": true, "reviewTime": "12 22, 2008", "reviewerID": "A4GMPJEEKD55J", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Ronald E. Winchel", "reviewText": "A verry well produced and directed 60ies film about the parinoia of the time of being invaded by aliens from another world.\n  The film is in black and white which adds to the inpact of the film.\n  The film was in a style that made the subject matter quite believable for the times.  The actors were quite believeable in thair charactors.\n  This all adds up to a classic film of the 60ies and quite watchable in my opinion.", "summary": "The Day The Earth Stoodstill", "unixReviewTime": 1229904000}
{"overall": 5.0, "verified": false, "reviewTime": "12 20, 2008", "reviewerID": "ANOAF9M5MTJHN", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "J. ta", "reviewText": "one of the best of the time and will never be any better no matter how much special effects they try to do.", "summary": "the day the earth stood still", "unixReviewTime": 1229731200}
{"overall": 1.0, "vote": "3", "verified": true, "reviewTime": "12 18, 2008", "reviewerID": "A41PWVB0GPC7G", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "Richard Caplan", "reviewText": "This a review of the blue Ray disk....this is not about the movie per say.  It is about chapter 81 when Patricia Neal is being carried to the saucer by Gort AND THE DAMN WIRES ARE STILL VISABLE!!!!!  WHY????  WHY COULDN'T THEY GET RID OF HER WIRES?  wHAT IS THE PROBLEM?  IT RUINES THE ENTIRE MOVIE!!!! SHAME ON YOU PEOPLE FOR DOING THAT TO US!!!", "summary": "WHY ARE THE WIRES STILL THERE?", "unixReviewTime": 1229558400}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "12 17, 2008", "reviewerID": "A1X054KUYG5V", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "One-Line Film Reviews", "reviewText": "The Bottom Line:\n\nThough not as good as its reputation would indicate, TDtESS is asimple, effective story that overcomes sometimes-poor special effects (note the strings when Gort lifts Patricia Neal) and inane dialogue (Klaatu barada nikto) to deliver numerous effective scenes and a powerful message.", "summary": "3 stars out of 4", "unixReviewTime": 1229472000}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "12 13, 2008", "reviewerID": "A20SO3O9ODU8KF", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Laurence G. Cripe", "reviewText": "Having reviewed this latest release of the 1951 movie - and within 14 hours having seen the recent remake - the contrast is amazing.  The black and white original version is the winner!  The most recent package is coherent, well-defined, and the audio is crystal clear.  The extras are appropriate and timely.\n\nThe movie and the message of the original have not stood still.  The acting is superb and the limited visual effects of the time are very well done.  With the \"Gort diaper\" and the \"Gort head-bob\" being the only real sticking points, this is the best version - hands down.  In terms of the well-tailored screenplay and the superior film scoring by the master - Bernard Herrmann - fifty-seven years could hardly improve upon it.\n\nIt's not appropriate to discuss the new movie in this format, but - in all fairness - the casting is superb, the CGI is as good as CGI can get (it's still obviously computer-generated)and the score is - well, it's there somewhere, but, let's face it - trying to score a remake of this classic took a lot of guts! !!!!!!!MOVIE SPOILER ALERT!!!!!! Gort's diaper problem and teeter-totter head are solved in the 2008 version.  Thankfully, the new version never quite went where I thought they were headed as to why we were going to be destroyed (they came close to dropping the global warming bomb).\n\nSo,take a look at the old movie and then see what a difference more than half a century makes in both the movie and the methods.  This remains a top ten sci-fi classic - you won't be disappointed.\n\nHow well do you know your \"The Day the Earth Stood Still\" Trivia?\n\n1. What was the speed and the altitude of Klaatu's saucer when it was first detected?\n\n2. What was the distance and time duration of Klaatu's journey from his home planet to earth?\n\n3. What was the firearm that Klaatu was shot with after he initially arrived on earth?\n\n4. What was Klaatu's room number and attending doctor during his stay at Walter Reed hospital?\n\n5. What was the date of the dry cleaning receipt for the clothing he took from Walter Reed hospital and what were the initials on the briefcase that Klaatu \"borrowed\"?\n\n6. How many soldiers does Gort end up killing?\n\n7. Where does Klaatu/Carpenter find a room for rent(address)?\n\n8. What is the full name, rank, and date of death of Bobby's father who was killed at Anzio?\n\n9. What is the plastic substance \"stronger than steel\" designation that they decide to encase Gort within?\n\n10. What is Dr. Barnhardt's first name?\n\n11. What distinguished award has Dr. Barnhardt received?\n\n12. What kind of homework is Bobby Benson working on that Klaatu/Carpenter assists him with?\n\n13. What kind of formula is Dr. Barnhardt working on that Klaatu/Carpenter assists him with?\n\n14. On Sunday, Bobby and Klaatu/Carpenter go out and take in Washington D.C.  Their itinerary takes them where, chronologically?\n\n(a) Arlington National Cemetery, (b)movies, (c) Lincoln Memorial, (d)visit the space ship, (e)Professor Barnhardt's house\n\nAnswers:\n\n(1) a,c,d,b,and e\n(2) b,c,e,a and d\n(3) a,b,c,d and e\n(4) a,c,b,d and e\n\n15. Klaatu's earthly escapades take place over\n\n(1) Three days - Saturday, Sunday, and Monday\n(2) Four days - Friday, Saturday, Sunday, and Monday\n(3) Five days - Friday, Saturday, Sunday, Monday, and Tuesday\n(4) Two days - Saturday and Sunday\n\n16. The actual day the earth stood still was on a\n\n(1) Monday\n(2) Sunday\n(3) Tuesday\n(4) Saturday\n\nYou will find the answers to this trivia questionnaire at the end of my review for 'The Big Country'", "summary": "Excellent New Version Outlasts the Remake!", "unixReviewTime": 1229126400}
{"overall": 5.0, "vote": "7", "verified": true, "reviewTime": "12 12, 2008", "reviewerID": "A31I3HXMD5H1EL", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Benjamin J Burgraff", "reviewText": "It's a very telling point, that the weakest feature of \"The Day the Earth Stood Still (Two-Disc Special Edition)\" is the preview of the 2008 remake of this classic. Seeing characterization supplanted by stereotype, mood replaced by special effects, and universal kindness, by cold aloofness, one can appreciate, even more, what a very special film the 1951 original was!\n\nCreated in an era of increasing paranoia, as the Cold War began, our failures in Korea created a sense of helplessness, and a nearly irrational fear of Communist world domination led to witch hunts in every field of endeavor, this simple tale of the galactic community sending an envoy to warn Earth to keep their problems 'at home', or face annihilation, offered a quiet note of reason for an insane time.\n\nIntentionally filled with metaphors (many of them, Christian in nature), the black and white film, directed by the legendary Robert Wise, has a Noirish, documentary 'feel', heightened by actual newspersons in cameo roles, describing the action. Despite the threat of giant enforcement robot, Gort, the actual emissary, Klaatu (brilliantly portrayed by Michael Rennie), is kind, and curious about our planet, and the film becomes a well-crafted character study, as he bonds with a widowed secretary (Patricia Neal), her son (Billy Gray), and Earth's greatest scientist (soon to be blacklisted Sam Jaffe). The real villain of the film is man's paranoia over anything they don't understand, and, sadly, despite a decisive display of alien technological superiority, the film offers only a small hope that we might come to our senses (which makes the film timeless, as we still haven't achieved the maturity the alien community demanded of us, over a half-century ago).\n\nThe new two-disc collection offers a wealth of special features, from the creation of the film (did you know that Claude Rains and Spencer Tracy were the first choices to play Klaatu?), a look at the remarkable electronic-based theremin, which created the unearthly musical effects, and brief histories of the era, personalities, and UFO sightings rampant in the late 1940s. Added treats include a dramatic reading of Harry Bates' story, \"Farewell to the Master\", which was the basis of the film (and far more chilling!), and an 'audio only' option, allowing viewers to savor both the theremins (two were used in the film), and Bernard Herrman's brilliant score.\n\nSo skip the unwelcome plugs for the new film, and savor the original classic, in this terrific edition!", "summary": "Two-Disc Edition of a Classic...", "unixReviewTime": 1229040000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 6, 2001", "reviewerID": "A1OBPHRXHZF8P6", "asin": "6302254132", "style": {"Format:": " VHS Tape"}, "reviewerName": "Robin Orlowski", "reviewText": "In the hands of joel schumacher and the acting lead of Adam Sandler, this romantic comedy would have been dumbed down to the level of a third grader and the nudity would have reached gratuitous proportions, but Michael J. Fox does a convincing job playing an upity young doctor who discovers that dreams take unexpected turns---sometimes for the better.\nEn route to Beverly Hills for his dream job, Benjamin Stone (Fox) gets punnished with community service after wrecking a farmer/judge's fence with his car. Fox carries out his sentence while his car is being fixed by two mechanics who act as if they have never seen anything other than a model T and hillarity ensues as city and country folk learn they have a lot more in commmon than previously thought.\nBelieing the stereotypes of southern women, The ambulance driver Lou, is a feisty animal rights activist and single parent who is well-read. The romantic tension and chemistry between her and Fox is convincing.", "summary": "Tear jerking", "unixReviewTime": 986515200}
{"overall": 5.0, "vote": "7", "verified": false, "reviewTime": "02 11, 2000", "reviewerID": "APYCNRS112N2B", "asin": "6302254132", "style": {"Format:": " DVD"}, "reviewerName": "Eat The Rich Books", "reviewText": "The title immediately put me off. The star, Michael J Fox immediately put me off. But once I got past those 2 major obstacles and settled in, I found a little gem of a movie.\nFox's young doctor, all full of spit and  vinegar, sets off across country to medical nirvana: a highly sought  position in a prestigious Beverly Hills plastic surgery practice. On the  way, Doc Hollywood is waylaid in definitive small town USA, Grady Ga. on  the cusp of the annual squash festival.\nAm I boring you? Likely, but this  film is never boring, a character driven comedy with superlative  performances in each and every nook and cranny-particularly David Ogden  Stiers (no Maj Winchester here) and Barnard Hughes. Woody Harrelson and  Bridget Fonda have smallish parts. Even George Hamilton is bearable in a  cameo.\nLiked it so much, I headed out to find director Michael  Caton-Jones previous effort,  Memphis Belle.", "summary": "The little movie that could.", "unixReviewTime": 950227200}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "08 1, 1999", "reviewerID": "A3UW0PQLDUACMH", "asin": "6302254132", "style": {"Format:": " DVD"}, "reviewerName": "Kent J. Smythe", "reviewText": "It's all worth it for Julie Warner's opening scene.....Yippee!", "summary": "NOT letterboxed like the laser disc", "unixReviewTime": 933465600}
{"overall": 5.0, "verified": true, "reviewTime": "01 2, 2015", "reviewerID": "A33MEPBFUGS9JN", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Mama C", "reviewText": "How\n could you not love Lucy and Desi!!", "summary": "How could you not love Lucy and Desi", "unixReviewTime": 1420156800}
{"overall": 5.0, "verified": false, "reviewTime": "11 10, 2014", "reviewerID": "A30BRDME36VZ4W", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "S. PARDOLL", "reviewText": "great", "summary": "Five Stars", "unixReviewTime": 1415577600}
{"overall": 5.0, "verified": true, "reviewTime": "09 6, 2014", "reviewerID": "A3KJGFSFIYF45", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Victoria H.", "reviewText": "Came one week later, great. I love it.", "summary": "great. I love it", "unixReviewTime": 1409961600}
{"overall": 5.0, "verified": true, "reviewTime": "08 31, 2014", "reviewerID": "A1V36MFNMYCDJG", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Chris", "reviewText": "This is a wonderful collection!", "summary": "Five Stars", "unixReviewTime": 1409443200}
{"overall": 5.0, "verified": true, "reviewTime": "12 17, 2016", "reviewerID": "AM9JAZXCVWQWT", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Ralph", "reviewText": "Great movie", "summary": "Five Stars", "unixReviewTime": 1481932800}
{"overall": 1.0, "verified": true, "reviewTime": "12 7, 2016", "reviewerID": "A1T74JYTQJT33S", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Not as described", "summary": "One Star", "unixReviewTime": 1481068800}
{"overall": 5.0, "verified": true, "reviewTime": "12 7, 2016", "reviewerID": "A1B0SG5409GSVY", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "DonZezeno", "reviewText": "Been wanting this movie for a long time. It is great", "summary": "Five Stars", "unixReviewTime": 1481068800}
{"overall": 5.0, "verified": true, "reviewTime": "02 12, 2014", "reviewerID": "A2MP86VNMFKGEY", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Captain Sa-Vage", "reviewText": "I bought the Stuntman from Amazon recently. It's a wonderful film with a bit of delightful  deviltry that will keep you interested throughout. I never see this film on TCM and I wonder why. Sir Peter O'Toole is the best at what he does, acting the hell out of his role. Barbara Hershey and Steve Railsback are marvelous supporting actors. They have a love relationship that's tough to get going. I didn't feel a strong chemistry between these two actors( I suspect because of O'Toole's menacing and immense presence), but compared to many so-called romantic relationships of today's movies, it was fine.\n\nO\"Toole plays a very talented,mercurial, creative film director who gets what he wants, no matter the cost or personal risk to himself or his crew and actors. This film is filmed with creative stunts and daredevil action. See it and enjoy.", "summary": "The Stuntman", "unixReviewTime": 1392163200}
{"overall": 5.0, "verified": true, "reviewTime": "11 26, 2013", "reviewerID": "A3FJR4UJ07BZSU", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Vickie S. Chapman", "reviewText": "One of my all-time favorite moves. Peter O'Toole's best role, Romance, action, adventure, comedy, suspense. Is it a drama? A comedy?  It's just great! Don't miss it!", "summary": "Great movie", "unixReviewTime": 1385424000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "09 18, 2013", "reviewerID": "A2SPF129OKGORN", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Gisela Hausmann", "reviewText": "As a former film industry professional \"The Stuntman\" has to be one of my all-time favorite movies, obviously. Already much has been said about Peter O'Toole's fantastic, even electric performance. There isn't anything else that I can add to this... other than I believe that secretly a lot of directors would like be like Eli Cross (including having Peter O'Toole's fabulous looks).\n\nI watched \"The Stuntman\" seven times in 1980 - in the movie theater - right when it came out. I even own a VHS tape, which I will never give up, never mind what how technology will change during my lifetime. I am a true fan of the movie.\n\nOver the years I realized why \"The Stuntman\"  has become such an enormous success and cult movie. \"The Stuntman\" manipulates the viewer too. Indeed, the viewer becomes part of the plot. Eli Cross needs an audience at all times. From the silver screen or the TV set he manipulates the viewer into siding with the one or other supporting role, only to abandon that position five minute later, when we get manipulated in siding with somebody else.\n\nIt's a true master piece and the ultimate movie about making movies.\n\nGisela Hausmann, author & blogger", "summary": "It's a true master piece and the ultimate movie about making movies.", "unixReviewTime": 1379462400}
{"overall": 3.0, "verified": false, "reviewTime": "12 11, 2008", "reviewerID": "AER15RIMV8E6D", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Pumpkin Man", "reviewText": "I watched this last night for the first time because the remake is coming out tomorrow and I wanted to see the differences between them. This has a pretty good storyline. I love how it has the classic look and feel of a 50's movie! A flying saucer lands in Washington D.C. and two people come out. An alien in human form named Klaatu, and a strong robot named Gort. Klaatu warns people to stop fighting and having wars or the earth will be destroyed. If you love classic sci-fi films, you'll love THE DAY THE EARTH STOOD STILL!!!", "summary": "Classic Sci-Fi!!!", "unixReviewTime": 1228953600}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "12 6, 2008", "reviewerID": "A1RJXO99BU5ZU5", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "Thunderhead22", "reviewText": "This looks great. I hope it sells like hot cakes. We need to support releases like this!\nMy only quibble is the cover art. It's not bad, but I would have preferred original vintage poster art.\nDon't forget to tap your zoom button during the photo gallery section. Those small pics look great blown up.", "summary": "Blu-ray is GO!", "unixReviewTime": 1228521600}
{"overall": 3.0, "vote": "4", "verified": true, "reviewTime": "12 5, 2008", "reviewerID": "A32EJ4MO4UQ5GY", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "John J. Jamack", "reviewText": "I bought the blu-ray version of the original and was not too impressed.\nI did give it a 3 out of 5 rating, for the effort. They should of included the colorized version along with the bloopers and any other colectibles.\nThe blu-ray version has nothing other than better black and white picture clarity. It was not really remastered, which is what blu-ray collectors have come to expect! Perhaps when they release the new movie on blu-ray they will include a COLORIZED REMASTERED version of the original. The movie studio really let us video collectors down on this one. Oh, and for those who like the original in B&W - there still are VHS tapes out there! The younger minded generation wants and demands great color at 1080P or better when they fork over the additional funds for blu-ray movies.", "summary": "Black and White only colectors. Not colorized.", "unixReviewTime": 1228435200}
{"overall": 3.0, "vote": "333", "verified": false, "reviewTime": "12 5, 2008", "reviewerID": "A36ER94271DHJZ", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "stryper", "reviewText": "First and foremost, this is a review for the 1951, black and white, 1.33:1 aspect ratio, 2-disc, special edition DVD and NOT for the remake (Gort! Keanu barada nikto :)\n\nOkay so here's the lowdown; as I now have both this new edition and the original single, flipper disc, version, and having watched all of the bonus features on the new 2-disc set, I can tell you this: keep the old disc!\n\nWhy, because the 73 plus minute, making of, on the original disc is gone, replaced with a new 23 minute fluff piece that only skims the surface of the story, of the making of this film.\n\nGone are the lengthy on camera interviews with the producer, director and female lead, replaced instead with film historian's inane babble, with the odd snippet of voice recordings of the director and producer, taken from the 73 plus minutes, making of, from the original disc (without the on camera picture).\n\nAlso gone, is the very interesting, \"Collectors\", segment, tacked onto the end of the original making of, which had several prominent collectors showing off such treasures as the original flying saucer model and Gort statue, used in the actual film, with anecdotes about the film, and where the props they now owned, had ended up after the filming.\n\nAs for the extra stuff added to the 2-disc set, nothing is worth the non-inclusion of the original making of from the first disc (most of the new stuff has nothing to do with the film, but instead conveys the political tensions of the world at that time, which, although slightly of interest, is not worth upgrading for).\n\nAnd on a new extra note for the new 2-disc set, the reading of, Farewell To The Master, is poorly executed, with a static picture with simple playing instructions, present throughout the entire reading (where as they could of has stills from the film playing throughout the reading, while the soundtrack played quietly in the background) and trying to maneuver through the reading is a nightmare, as there are three chapter stops, which are about 10 plus minutes each, with no way of fast searching through the 10 plus minute segments, so if you stop playing the reading at 9 minutes, you can't start the playback where you left off but instead have to listen to the whole thing from the start of the chapter (I know this because I stopped the playback for a minute, and when I hit the play button on the remote, the film started to play, so I had to go back to the menu and start the reading again, and listen to the stuff I had already heard. I would have preferred that an onscreen text version of the short (45 pages - not so short in my books) story be included instead).\n\nSo unless you are a completes, then this 2-disc version isn't worth the money, and even if you are looking to buy this for the first time, I'd HIGHLY recommend that you pick up the original DVD release, as the picture quality is the same, and you get the far superior 73 plus minute, making of, along with the director's commentary, picture galleries and original trailer.", "summary": "A Review Of The New 2-Disc, \"Special Edition\" DVD of, THE DAY THE EARTH STOOD STILL", "unixReviewTime": 1228435200}
{"overall": 3.0, "verified": false, "reviewTime": "12 4, 2008", "reviewerID": "A126KX6FVI4T66", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Roger Bagula", "reviewText": "They are remaking this with the Matrix Messiah actor as\nKaltu, the alien. One really doubts that the warning\nwill have any more effect in the current age than it\ndid in the past? Peace is not a message that politicians\nand general want to heed?\nWe are literally cooking ourselves and our planet\nand no external alien message is going to wake us up?!", "summary": "The cold war went on for about 40 years after this movie came out", "unixReviewTime": 1228348800}
{"overall": 1.0, "vote": "7", "verified": true, "reviewTime": "12 4, 2008", "reviewerID": "A3TOGNYF1V9PHW", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "Birdman", "reviewText": "Why issue a Blu-Ray version that is not in 16-9 format? This is no different than watching my old copy on my 1080P set. They cleverly state the aspect ratio as 1.33:1 which is the same as 4:3. When I ordered it I thought that was a mistake. Shame! We have been deceived!", "summary": "Ripoff!", "unixReviewTime": 1228348800}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "12 3, 2008", "reviewerID": "A3EOYN87MMNHL1", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Phoebe Stogstill", "reviewText": "I hope you will re-view this Fab Sci-Fi Film of the Fifties.  The message it contains is a good one, not only in our dealings with other worlds, but in dealing with our own world. It is what happens when people try to \"kill the messenger,\" or when mob mentality wipes out the most innocent and the mob becomes the very thing the mob is trying to eradicate. Patricia Neal (that marvelous voice) takes every production she is in up at least one notch.  Michael Rennie is believable as Klaatu and Frances Bauvier (Aunt Bea) and Sam Jaffee (Dr. Zorba) are fine supporting players.  The robot, Gort, is one of the most entertaining visuals in Fifties Sci-Fi Films.  A really, really good movie.", "summary": "\"Klaatudenous, With a Lot of Gort 'on the Side'\"", "unixReviewTime": 1228262400}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "12 3, 2008", "reviewerID": "AJUFIGATSP9AQ", "asin": "6302168465", "style": {"Format:": " Blu-ray"}, "reviewerName": "iNO!", "reviewText": "In DTS-HD MSTR no less. Bernard Herrmann's music really gets my attention and that part of the sound mix is real; Pure Mono also. HD does B&W very well and picture is great! This is where Blu-Ray replicates the projected film experience (notice different film sources as result of TV edits) I'll like the new movie, even if it has issues because I love scifi and it's slim pickens these days. If this seems like an old movie, just think Twilight Zone and you are in familiar territory. The story? Let others give you details but it's top drawer Desert Island List for sure.", "summary": "Favorite 50s B&W Sci-Fi Film on Blu-Ray....WOW", "unixReviewTime": 1228262400}
{"overall": 5.0, "verified": true, "reviewTime": "12 4, 2016", "reviewerID": "A14LSJU64BHFFW", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Lance B.", "reviewText": "Classic film. Keanu Reeves at his best.", "summary": "Keanu Reeves at his best.", "unixReviewTime": 1480809600}
{"overall": 2.0, "verified": true, "reviewTime": "11 25, 2016", "reviewerID": "A89WSKKJAMUDS", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "Robert E. Riegel", "reviewText": "have just purchased my SECOND 'replacement' BluRay Player and this will STILL NOT play. as it has for years, it states on-screen that it is \"INVALID\"", "summary": "will STILL NOT play", "unixReviewTime": 1480032000}
{"overall": 5.0, "verified": false, "reviewTime": "11 16, 2016", "reviewerID": "A3AX33KK6HQC8H", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "MR_ACTION", "reviewText": "UTAH, GET ME TWO, MORE VIEWINGS OF THIS AWESOME MOVIE! Utah is Johnny Utah and he plays an FBI agent that goes undercover to hang out with these super cool surf guys who love having fun on the water and off. Patrick Swayze is the leader of ultra cool surf gang; the boys and they call themselves the Ex-Presidents when they're off playing Robin Hood. I always thought surfing was stupid until I saw this awesome movie! This movie is based off a book, which is dumb so thank goodness for this movie. Its got babes in bikinis and dudes with guns so obviously I loved it and so will you if you like awesome things that are obviously cool and full of action. THEY JUMP OUT OF PLANE! Which I don't even know if thats possible but they made it look real, oh wait, thats because it was real 100% of all of it because these guys know how to go hard. For a girl, Kathryn whatever her name did a great job with a mans genre.", "summary": "POINT AWESOME!", "unixReviewTime": 1479254400}
{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2016", "reviewerID": "A1ZS6DJ95CFEL7", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "sgal", "reviewText": "This is a totally awesome movie. It's a must see.", "summary": "Five Stars", "unixReviewTime": 1478649600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 12, 2013", "reviewerID": "A7MVL4WN8IGTX", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "Adele P. Douglass", "reviewText": "Although the clothing and hair styles are dated... O'Toole is not.  He looks great and plays the role perfectly.  One never gets a handle on who he is, you can't put him in a box or define the character easily even through the end of the movie.  Very interesting and entertaining...", "summary": "The Director as God!", "unixReviewTime": 1376265600}
{"overall": 5.0, "verified": true, "reviewTime": "06 7, 2013", "reviewerID": "A3PV743O9Y6WUG", "asin": "6302260973", "style": {"Format:": " Amazon Video"}, "reviewerName": "Amazon Customer", "reviewText": "With out a doubt, the best of the 80s. Nina! You have Peter OToole as Eli Cross, Steve Railsback as Lucky, and Barbara Hershey as Nina (the actress so fair). A movie within a movie. I will say no more! A MUST SEE for the Movie Buff in the family, any family. \"Nina! You can go!\"", "summary": "Come here to me!", "unixReviewTime": 1370563200}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "04 12, 2013", "reviewerID": "A3GLALCBHOR3T", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Harry Georgatos", "reviewText": "This is a film that can't be classified in any genre or any kind of obvious formula. There's comedy, drama, action and social satire in the making of a Fellini type Hollywood WW1 production.\n\nThe plot is an ex-Vietnam vet fugitive on the run from a skirmish with the law and accidently kills a stuntman and finds himself taking the place of the dead stuntman on the movie production.\n\nThe movie deals with themes of illusion versus reality and the social desease of paranoia. Peter O'Toole as the God-like, over-the-top director with Jesus Christ elements to his character gives one of the great performances in cinema. This director will easily manipulate and embarass and bring down any cast or crew member that gets in the way of his deranged vision in the making of his film. Peter O'Toole's character, Eli Cross, flys around from God-like POV's, from his swooping helicopter and his large flying killer cranes, yelling God-like instructions from his booming megaphone.\n\nThis film has one of the most brilliant scores on it's soundtrack. It has a melodic carnival beat that's extremely infectious. By the end it's great filmmaking and one of the best cult films to come out in the 1980's.", "summary": "One of a kind", "unixReviewTime": 1365724800}
{"overall": 5.0, "verified": true, "reviewTime": "03 19, 2013", "reviewerID": "A173RNRO9C8YJN", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Al Snow", "reviewText": "I first saw this movie while on submarine patrol in the early 80s. I swear Peter O'Toole is off for much of the movie, but wtching it after purchasing it I realized how much I missed of the dialogue. Not for your average movie-goer, but if you like clever dialogue and subtle plot you will love this one.", "summary": "Quirky, funny movie", "unixReviewTime": 1363651200}
{"overall": 4.0, "verified": false, "reviewTime": "02 26, 2013", "reviewerID": "A1MM6PU8E3VZ5L", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "A. Nathaniel Wallace, Jr.", "reviewText": "Cameron is a man on the run. Sought by the police for a crime of passion, he is cornered in a small diner by CHP men. Brutally clamped into handcuffs, Cameron overcomes the cruel cops and manages to escape their dragnet. A cable lineman attempts to stop him but instead gets beaten up by the tough Vietnam veteran.\n\nLater Cameron is almost run down by a man in a car. The car falls over the edge of a bridge, killing its driver and Cameron makes his way to a film shoot and is subsequently taken in by the director who decides to use him as a stunt man to replace the now dead stunt man. Cameron is trained by Chuck, the stunt-coordinator and using his Vietnam experience quickly gets the hang of the industry. The filming of the movie continues but cameron realizes the cops are still looking for him. But that's not the worst of his problems. He suspects that Eli Cross (Played Magnificently By O'toole) is trying to kill him.\n\nI won't ruin any more of oyur suspense. However, I will say this: This movie was a movie that gave us a lense into what goes on behind the scenes in movies. At the time this movie was released in 1980 this was a rarity. Any laymen watching this movie will be amazed at the effects and stunts that are shown.\n\nMy quibbles with the movie are these: Why did the man who drowned pick up Cameron in the first place. More to the point, why did he try to kill him? This was never explained and as a result I removed a Star from the film's rating. I would also have liked to learn what happened to Cameron. Did he escape the cops? If so, how? Did he get the $1000 bucks he demanded for his stun-which would have permitted him in 1980 to live on the lam a little longer-or did he have to continue working for Eli at the industry minimum of that time period? Did he get the girl? I wanted to know and as a result I will have to read the book to gain any answers that might exist.\n\nThe movie is produced and edited quite well. I'm proud to be the 76th person to make a review of this fine flick and the 13th to make a Four-Star review. Buy the DVD and you won't be disappointed.\n\nA. Nathaniel Wallace, Jr", "summary": "Wonderful Movie", "unixReviewTime": 1361836800}
{"overall": 3.0, "verified": true, "reviewTime": "12 4, 2012", "reviewerID": "A35QHC2DWI1Q0E", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Eisweino", "reviewText": "Confusing, pretentious, self-indulgent, engaging and boring alternately, thought-provoking in a shallow do-your-own-thing sort of way, and a waste of time except for O'Toole fans.  It is very much his movie, for better and worse.", "summary": "For O'Toole fans only", "unixReviewTime": 1354579200}
{"overall": 1.0, "verified": true, "reviewTime": "08 14, 2014", "reviewerID": "A3H73JMUSF0JMV", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "AT4G7", "reviewText": "Dumb movie.  We turned it off.", "summary": "Dumb movie. We turned it off", "unixReviewTime": 1407974400}
{"overall": 5.0, "verified": true, "reviewTime": "07 5, 2014", "reviewerID": "A1O6KFWX2MCU3F", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Annie Reiter", "reviewText": "Need learn love and camp", "summary": "Five Stars", "unixReviewTime": 1404518400}
{"overall": 2.0, "verified": true, "reviewTime": "06 30, 2014", "reviewerID": "AAM5BCE9FZVAJ", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "RPF", "reviewText": "The set up for the plot takes about an hour, and the \"funny\" typical Ball moments were stuck into 30 mins.", "summary": "Unfortunately Bad", "unixReviewTime": 1404086400}
{"overall": 5.0, "verified": true, "reviewTime": "03 31, 2014", "reviewerID": "A2SFUXVK5RP8VE", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "nelly123", "reviewText": "I love lucy I grew up with her and her shows and I would recommend this to anyone who wants to laugh", "summary": "lucy", "unixReviewTime": 1396224000}
{"overall": 3.0, "verified": false, "reviewTime": "03 19, 2014", "reviewerID": "ANCOMAI0I7LVG", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Andrew Ellington", "reviewText": "Ive always loved Lucille Ball.  She was such a firecracker, and she had some serious acting chops, not merely comedic and but she knew how to convey a deeper feeling, an intimate sadness that Im sure had a lot to do with her personal life and working so closely with the man she experienced true highs and lows with.  Their television career was a great professional high for them, while their cinematic career was probably considered a low.  They only made three films together, and none of them were commercial or critical successes.  Their talents were largely considered strictly for the TV.\n\nI stumbled upon this 1956 film a few nights ago, and I must say that I was pleasantly surprised.\n\nFirst, it didn't play out like an I Love Lucy sketch, which I was afraid it might.  Instead, this had a personality all its own.  Yes, it did have the physical comedy that didn't feel remarkably unique, but that was a small part of the film.  I will admit, the film does feel like two films pushed together, possibly even three, but the film is brisk enough to entertain that notion without feeling overwrought.\n\nBasically, Susan is from money and her closest friends resent her new husband, Lorenzo, who is a homely scientist who desires to get away from all things new and flashy and really LIVE his life.  Susan is torn, but a visit from her guardian angel changes all that and she decides to accompany her husband on a brief expedition to further his research and cure their marital problems.  The lead up to the guardian angel talk is nicely composed, with some pitch perfect dialog.  The guardian angel bit is a tad tired and elongated, and then the expedition is corny but brief and entertaining.  Really, this is completely enjoyable thanks to Balls dynamic presence.\n\nIts not a great movie, but it is well worth a gander.", "summary": "I love Lucy, as always", "unixReviewTime": 1395187200}
{"overall": 4.0, "verified": true, "reviewTime": "03 3, 2014", "reviewerID": "AOWFY1Y4KL06T", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "JIL", "reviewText": "I LOVE LUCILLE BALL IN MOST OF HER MOVIES BUT HATED THE TV SHOWS.  THIS WAS ONE OF HER LATER ONES AND WAS CUTE.  JAMES MASON AS AN ANGEL WAS CLEVER.  NOT THE TYPE OF ROLE THAT HE USUALLY PLAYED.", "summary": "CUTE.  ALWAYS LOVE LUCY", "unixReviewTime": 1393804800}
{"overall": 5.0, "verified": true, "reviewTime": "11 7, 2016", "reviewerID": "A2M0MXJLSZCQ0", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "iamesp", "reviewText": "Great product for a great price.", "summary": "Five Stars", "unixReviewTime": 1478476800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "11 3, 2016", "reviewerID": "A121IZXCXUR96H", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "Mark R.", "reviewText": "Great movie, Keanu and Swayze were a fantastic match", "summary": "Surfs up", "unixReviewTime": 1478131200}
{"overall": 5.0, "verified": true, "reviewTime": "10 28, 2016", "reviewerID": "A3JRJFGW9MK7WF", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Virginia Howard", "reviewText": "Great movie", "summary": "Five Stars", "unixReviewTime": 1477612800}
{"overall": 4.0, "verified": false, "reviewTime": "08 24, 2012", "reviewerID": "ANCOMAI0I7LVG", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Andrew Ellington", "reviewText": "Outside of a horrendous performance by Steve Railsback, `The Stunt Man' is a bizarre trip of a film that lives up to its high regards and delivers a satisfying and surprisingly thought provoking look at the thin line between reality and fantasy.  When an escaped convict stumbles onto a movie set, a deranged filmmaker sees him as his ticket out of a jam.  Eccentric director Eli Cross has no regard for human life and so his constant pursuit of cinematic perfection has just cost the life of his key stuntman.  To avoid controversy he attempts to pass off Cameron, the convict, as the late stuntman and offers him his job.  Cameron changes his look and dons the dead man's duties and soon falls for the pictures leading lady, Nina.  Eli's madness soon takes hold over everyone on set, including Cameron, who begins to fear that Eli is actually trying to kill him.  Railsback is far too over the top, and he takes the films theatricality too far.  Faring far better are O'Toole and Hershey, who both show splashes of melodramatic theatrics yet understand how to keep their performances far more grounded in the film.  All in all, this is a really good film.  It is one of those films that begs to be seen more than once, because it has more to say than meets the eye.", "summary": "Everything is not what you think...", "unixReviewTime": 1345766400}
{"overall": 3.0, "verified": true, "reviewTime": "10 18, 2011", "reviewerID": "A2VJ80PM1G00QV", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "drkhimxz", "reviewText": "\"As innovative today as CITIZEN KANE was in its time\"- Los Angeles Times. is the blurb on the front cover of the disc container. You can accept that if you like; I think it was probably the result of a series of meetings between the writers and the director out of which emerged an inchoate manuscript, from which the newest girl/boy in the typing pool, a film  major at UCLA, desperately put together the final shooting script. It really is an incoherent mess, salvaged only by some good stunts and over-the-top efforts, by a couple of talented stars and assorted, probably equally adept, supporting players. Of Steve Railsback, I know nothing, so I refrain from any credit or criticism. He may not have had much to do with how he came out on the screen.\nAs best I can figure out, an escaped prisoner, pursued by the police, was given sanctuary by an ego-maniacal director,  despite the fact that he had caused the death of one stuntman, which act, the director covered up, making himself, at the minimum, guilty of obstruction of justice, plus conspiring to protect a fugitive he knew to be wanted by local and federal authorities, and, probably, if past precedent in very dangerous stunts that went awry, involuntary manslaughter. (Not being a student of criminal law, these are not the exact terms for his acts, and many more he committed, Peter O'Toole played pretty much from his background with similar types of characters and Barbara Hershey certainly looked desirable.\nHowever, as I said at the beginning, you, too, may believe it to be as innovative as Citizen Kane.\nI should  point out that it is not the many criminal acts to which I objected, it is the lack of coherence, wit, sensibility, or meaningfulness.", "summary": "An Odd  Film", "unixReviewTime": 1318896000}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "09 18, 2011", "reviewerID": "AM7L2TIW8AR4B", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Shane Adam Bassett", "reviewText": "Funny as this film may be, it's harsh and deserves all the praise in which it has always received. Mainly thanks to Peter O'Toole who never lets you down (even in High Spirits). The supporting cast do have a upper hand falling into place around the irresistible Mr O'Toole and to make things even cooler for the movie fanatic, the whole movie is all about the film industry. Highs & Lows, glamour and darkness, this is a must for your collection. The extras are as good as the film itself, unforgettable.", "summary": "Peter O'Toole is fantastic, brilliant even.", "unixReviewTime": 1316304000}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "08 19, 2011", "reviewerID": "A16CZRQL23NOIW", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Hiram Gmez Pardo Venezuela", "reviewText": "The fragile boundaries between sanity and insanity; the real world regarded as cathartic experience had never been so brilliantly explored since the times of three previous films of the recent past, from the early Forties The Citizan Kane, from the sixties Shock corridor and from the seventies, Catch 22.\n\nA Vietnam veteran, Cameron (Steve Railsback) is on the run with the justice, due his troubled mind leads him to an involuntary  murder attempt. Since this incident, he becomes an outlaw and begins to run away.\n\nIt's just in a bridge when the criss cross happens. A stunt man higly excited pursues the outer reality and intends to run over him : since this twist of fate appears, makes Cameron assumes his role, crossing the border to get into the fiction : a movie about the war, whose director Eli Cross feels himself like a Deux Ex machine inside his field.\n\nRobert Bresson was right when affirmed that to direct a film is like being a general in the battlefield. Eli Cross is like \"The Big Brother\" in 1984, scrutinizing every single detail around the backstage and considering his staff must be watched night and day. So, this outrageous behavior is what it sets out the following question: Is the insanity a part of the creative freedom? This ruling personage tries to capture the essential expression, the visceral emotion without masks, showing us the pretended sanity of the outer world may never be ahead the goal of cinema.\n\nOf course, the vast spectre of the language of cinema is there: drama, intrigue, comedy, double cross, love affairs and minor scandals that integrate the whole picture.\n\nSo, we are before the best American film since it was released. And with the honorable exception of these five films (except Fellini's Casanova, Good morning Babylon in the past and Brazil, Sex, lies and video and Zentropa) the fragmentation and dissolution had never been so magnificenly exposed and better expressed than \"The Stunt man.\"\n\nIt's useless to affirm, my worthy reader this a masterpiece from start to finish. An eternal cult movie since its immediate release.", "summary": "The elusive frontier between the chaotic reality and the garden of dreams!", "unixReviewTime": 1313712000}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "08 15, 2011", "reviewerID": "A319SKSB556033", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Inspector Gadget", "reviewText": "It's called 'subjective reality', children. The fact that the truth depends on the angle you happen to be watching from gives us all our unique, if skewed and unfair, perception on life. We're all puppets in someone else's dastardly play and we never know when that person, that entity, that divine being will cut our strings.\n\nThis was director Richard Rush's dream project and it took him nine years to get it on the screen. And, of course, it would! It's multi-layered, original, funny and packed full of story and circumstance that makes you think. Why would any studio want to touch it? Fox even sat on it for two years before giving it a limited release. Even on its umpteenth viewing it delivers again and again, offering new angles and subtle clues.\n\nThe viewpoint of this metafictional masterpiece is Cameron (Steve Railsback), a Vietnam vet on the run from the law. He stumbles onto the set of a WWI movie and accidentally kills a stunt driver. The director of the movie is the eccentric and megalomaniacal Eli Cross (Peter O'Toole, in one of his best ever performances), who takes Cameron under his wing and protects him from John Law, as long as he keeps his mouth shut about the accident.\n\nCameron practices to be a stunt man and takes the place of the man he killed. But as the movie shoot becomes more elaborate and dangerous, he falls in love with the leading lady (Barbara Hershey) and starts to suspect that Eli is trying to capture his death on film.\n\nAlthough it seems nasty, the movie is wonderfully light-hearted and the outrageous stunt scenes are backed up by an awesome score by Dominic Frontiere. I've been humming that theme since I was 12-years-old when I taped it off Channel 4 in December 1992. I didn't quite get it back then, but I nearly wore out that VHS watching it over and over. A long scene with Cameron running over a rooftop, as biplanes attack and enemy soldiers give chase, is pure joy. There is a great comic sense of humor in watching them trip over each other, fall off, and get blown up.\n\nJohn Law do not back down on their suspicion of Eli and, through half-heard conversations and eavesdropping, Cameron's paranoia becomes increasingly justified. Because the movie is seen through his eyes we never quite know what is going on with Eli. Is he a madman, or just a crafty director? Would you believe that Peter O'Toole based his performance on his experiences with David Lean? Why he never won an Oscar (it went to Robert DeNiro for Raging Bull)- is beyond me. He truly gives the performance of his career, far exceeding even Laurence of Arabia. It also sucks that Rush never won for Director, or Adapted Screenplay. Had he been awarded the golden statuette, maybe he would have received more recognition. He's clearly a better filmmaker than most of today's hack artists.\n\nYou simply have to see The Stunt Man. It's an overlooked gem and, despite the wide praise it received, it has never really reached a large audience. Now is definitely the time to rediscover this forgotten classic.\n\nThe Blu Ray presents the film in 1.85:1 108p HD. The print has just a tiny amount of dings and scratches but it's otherwise fin, and aside from a few grainy shots in several scenes the film's slick, high-key photography looks stunning. The DTS HD-MA sound makes sure all the explosions and Frontiere's boisterous score have never sounded better. Extras are certainly plentiful. The BD is NOT region-locked either.", "summary": "Colors splash and re-arrange the sky, and reality...is yours to deny", "unixReviewTime": 1313366400}
{"overall": 3.0, "verified": false, "reviewTime": "08 2, 2011", "reviewerID": "A381JHHZVQQ9SZ", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "tarantula arms", "reviewText": "I was really looking forward to this movie and was very excited when it was released in affordable DVD.  With Peter O'Toole and Steve Railsback it should've been a great show.  But it wasn't; it was only okay.  Not enough O'Toole (and if you want a GREAT Peter O'Toole movie go with \"My Favorite Year\") and Steve Railsback, so good in \"Helter Skelter\" and years later in \"Ed Gein\" is not convincing as a damaged veteran or an accomplished stuntman.  Does the guy get killed?  Does he ride off into the sunset with the leading lady?  These questions are answered, it just takes forever to do it.  Not a long movie, but it sure feels like it.", "summary": "Cult doesn't mean Great", "unixReviewTime": 1312243200}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "08 1, 2011", "reviewerID": "A2QKMTVZK2GWIH", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "dnewman2", "reviewText": "What an odd career director Richard Rush has had.  He ground out several low budget exploitation pictures in the 1960's with titles like TOO SOON TO LOVE, HELLS ANGELS ON WHEELS and PSYCH-OUT (the latter two featuring pre-fame Jack Nicholson), primarily through Samuel Arkoff's American International Pictures.  His 1970 movie, GETTING STRAIGHT starring Elliot Gould, was one of many undistinguished, studio-driven youth-rebellion flicks of the day.  And Rush's 1974 cop-buddy comedy, FREEBIE AND THE BEAN with Alan Arkin and James Caan, was a mid-level programmer for Warner Brothers.\n\nBut when Richard Rush shuffles off to that great director's chair in the sky, he can pretty much rest assured that the movie he will be remembered for is his 1980 tour de force, THE STUNT MAN.  (It probably won't be 1994's THE COLOR OF NIGHT, the only feature he has subsequently directed.)\n\nTHE STUNT MAN weaves the contemporary tale of Cameron (Steve Railsback), an escaped convict eluding some not very diligent police, who stumbles upon a movie company shooting a World War I film in and around San Diego's famous Hotel del Coronado.  The film-within-the-film is helmed by the megalomaniac director, Eli Cross, fabulously played by the great Peter O'Toole in one of his signature roles.  With the movie's primary stunt double killed in an accident (which Cameron might have partly caused), Eli recruits the runaway con/Vietnam vet to become the leading actor's stunt man.  Cameron's immediate infatuation with the beautiful Nina Franklin (Barbara Hershey), the lead actress in the movie, further entangles him in behind-the-scenes intrigue.\n\nAn under-the-radar movie upon its release, THE STUNT MAN was helped by some key critical recognition, most notably by The New Yorker's Pauline Kael, probably the most influential film writer at the time.  A modest financial hit, it went on to garner three Oscar nominations for Best Actor (O'Toole), Best Director and Best Adapted Screenplay (Lawrence B. Marcus and Rush).\n\nTHE STUNT MAN is designed to work on several levels, and for the most part, pulls it off.  First, it's a movie about movies.  Rush takes great cinematic joy in presenting the inner workings, both mechanical and psychological, of a movie company, circa 1979.  Having worked on many film sets around that time, I can attest that, for the most part, he gets it right.  It's also a film about identity, power and control.  And in a world devoted to creating illusion, the question hanging over all of THE STUNT MAN... What is real and what isn't?\n\nBut while Richard Rush flirts with all of these themes in THE STUNT MAN, he never digs deep beneath the surface of any one of them.  They are there to entertain, and they do.  Just like Rush's direction.  He seems to be having so much fun finding ways to keep his movie visually engaging and mildly oblique, that we are happy to go along for the ride.", "summary": "The movie he'll be remembered for", "unixReviewTime": 1312156800}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "11 9, 2008", "reviewerID": "A2JLLO0J33IK0F", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Robert Macdonald", "reviewText": "Not a sci-fi movie for todays generation which is a shame. Gore, violence and explosions traded in for acting, atmosphere and great story telling. One of my favorite movies. And as for the \"editorial review\", Gort didn't destroy Washington. Get it right and get this movie.", "summary": "Sci-fi at it's best", "unixReviewTime": 1226188800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "10 30, 2008", "reviewerID": "A2X6BDED2RTFX4", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Wayne M. Smith", "reviewText": "This is a classic film from the 1950's.  The first time I saw it was on the late late show in the mid 50's.  I am wondering how the new version will stack up to this giant!", "summary": "The Day the Earth Stood Still", "unixReviewTime": 1225324800}
{"overall": 5.0, "vote": "25", "verified": true, "reviewTime": "10 1, 2008", "reviewerID": "AWW09N2XQA64V", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Steve E. Rivkin", "reviewText": "This is supposed to be B&W not color - a listing error\n\nExtras for this release include:\n\nCommentary by Robert Wise and Nicolas Meyer\nCommentary by Film & Music Historians John Morgan, Steven Smith, William Stromberg and Nick Redman\nIsolated Score Track\nThe Mysterious, Melodious Theremin\nThe Day The Earth Stood Still Main Title Live Performance By Peter Pringle\nThe Making of The Day the Earth Stood Still\nDecoding \"Klaatu, Barada, Nikto\": Science Fiction as Metaphor Featurette\nA Brief History of Flying Saucers Featurette\nThe Astounding Harry Bates Featurette\nEdmund North: The Man Who Made the Earth Stand Still Featurette\nRace To Oblivion: A Documentary Short Written And Produced By Edmund North\nFarewell To The Master: A Reading By Jamieson K. Price Of The Original Harry Bates Short Story\nInteractive Pressbook\nFox Movietonews from 1951\nTheatrical Trailer\nAdvertising Gallery\nBehind-The Scenes Gallery\nPortrait Gallery\nProduction Gallery\nSpaceship Construction Blueprints\nShooting Script\n\nsome say an ad trailer for the new movie will now be included, I expect to be disappointed in the new movie but will check it out anyway\n\n- Steve R , great nephew of Bernard Herrmann who did the original music for this movie - this DVD will contain an isolated music track for those who want to hear just the music at some point", "summary": "TDTESS info", "unixReviewTime": 1222819200}
{"overall": 4.0, "verified": false, "reviewTime": "09 25, 2008", "reviewerID": "A3SFO2GSP5CVSM", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Cosmoetica", "reviewText": "The other day I bought the DVD of one of my favorite all-time films: The Day The Earth Stood Still. In watching it I was struck by how relevant this sci fi classic from over 50 years ago is to today's political milieu. In brief, a flying saucer lands in Washington, D.C. Its occupant is a creature that looks human enough, named Klaatu (Michael Rennie). He is injured by fearful humans as the military surrounds the spacecraft. He is rescued by an all-powerful robot named Gort, who vaporizes the military machinery.\n  Klaatu decides to infiltrate human society under the pseudonym Carpenter and takes up residence at a local boarding house, where he meets a widow named Helen Benson (Patricia Neal) who has a 10 year old son Bobby (Billy Gray of later Father Knows Best fame). In short, Klaatu is hunted down and killed by the military, then resurrected by Gort, who is aided by Helen, who knows the phrase that can control Gort: Klaatu Barada Nikto. Upon leaving Earth Klaatu issues an edict: either humans can change their ways or they will be exterminated if they spread their nuclear terror to the stars. Klaatu has only been an emissary from an organization called the United Planets. Gort is merely one of many all-powerful robots that police the UP registry and battle warring instinct with extermination- a policy all UP members submit to. With this knowledge Klaatu and Gort leave Earth to ponder its fate.\n  Of course, the film has provoked many philosophical, ethical, and political salvos through the years. Made during the early years of the Cold War its symbolism was obvious, and its `message' later became standard fare for much of the early `real' UFO lore, depicted by the `Contactees' of that era. But, its message still resonates today, in the post-Cold War restiveness of dying religious Fundamentalism's death throes. Especially since Rennie plays a near-Christ-like character.\n  It has also been vociferously attacked as `liberal' propaganda. Many Leftists of the day saw the film as a plea against the insanity of the nuclear arms race, which was insane- not because of the arms race mentality, but because total annihilation could occur by error, and not intent. Rightists pointed out that the `peace' offered by Klaatu, Gort, and the UP comes only if humanity is either content to remain earthbound, or submit to the tyranny of the Gortian robocops. Counterarguments span range from the social compact gambit- i.e.- that while Earth is our home and we can do what we like the universal society at large has every right to set up its own laws and penalties. After all, we are free to parade around naked in our own homes, but not in public- to the sanity defense- that any society advanced enough to discover interstellar travel will likely create weaponry capable of planet destruction, therefore only a preemptive ban and enforcement can work.\n  Yet, there does seem something amiss with Klaatu's UP. Klaatu shows he has the power to utterly immobilize human machinery (hence the film's title) yet it is oblivion or else- no degrees of shading, such as `we'll take away all your nuclear toys if you humans are bad'. It's Armageddon or compliance. The UP has no problems with hypocrisy or `benevolent' dictatorship. If we are too violent, by UP standards, they will counter with the ultimate violence. This is their law, and will be applied without any research into why humans fight: exploitation, racism, sociology, and ideological differences as reasons are all equally wrong, even if in self defense. The query rises- is peace without freedom a virtue?\n  It has been counter-argued that there is such a thing as limited freedom- we do not have the right to infringe upon others' rights with our own. Klaatu claims the only freedom the UP has given up is the freedom of violence. Violence is the only freedom that is policed by Gort and his robotic brethren. The film has thus been seen as posing the question How would society function if disputes had to be resolved without violence? And it's a good query.", "summary": "Classic", "unixReviewTime": 1222300800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "09 24, 2008", "reviewerID": "A1GGOC9PVDXW7Z", "asin": "6302168465", "style": {"Format:": " VHS Tape"}, "reviewerName": "Annie Van Auken", "reviewText": "Filmed entirely on the FOX backlot (except for a few 2nd unit shots of D.C.), no one at the time could have imagined that THE DAY THE EARTH STOOD STILL would reach legendary status and remain there almost 60 years later.\n\nThe story of the arrival in the U.S. capital city of alien Klaatu and his policeman robot Gort remains relevant to this day. Klaatu's message that Earthlings are becoming a threat because of their militarism and nuclear weapons might be right out of today's news.\n\nKlaatu comes in peace with a communique vital to our planet's survival and is immediately wounded by rifle fire for his efforts. After escaping from Walter Reed Hospital, Klaatu takes on the alias of Carpenter and becomes a boarder with Helen Benson (Neal). He instantly bonds with Helen's son, Bobby (Gray) and the two go on a D.C. sightseeing tour that ends at the home of Prof. Barnhardt (Jaffe). \"Carpenter\" solves a complex mathematical equation on the not-home professor's chalkboard, and leaves a note with his name and address.\n\nLater, Carpenter/Klaatu enlists Barnhardt's aid in telling all the nations of Earth that the planet will be destroyed if a way ian't found for everyone to live in peace. He also reveals his true identity to Helen; her boyfriend, Tom (Marlowe) betrays Helen's confidence and informs the authorities of Klaatu's whereabouts, but if he's killed, robot Gort is programmed to destroy the Earth.\n\nAnother recommended 1950s sci-fier is INVADERS FROM MARS, where intelligent life from the red planet have a plan to turn everyone on Earth into willing slaves.  (<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/VHS-version/dp/6304401892/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">VHS version</a>) - (<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/DVD-version/dp/B00000IBTR/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">DVD version</a>)\n\nParenthetical number preceding title is a 1 to 10 IMDb viewer poll rating.\n\n(7.9) The Day The Earth Stood Still (1951) - Michael Rennie/Patricia Neal/Hugh Marlowe/Sam Jaffe/Billy Gray/Lock Martin (as Gort) Themselves: Drew Pearson/H.V. Kaltenborn/Gabriel Heatter  (uncredited: 'Snub' Pollard/Holly Bane)\n\nTRIVIA:\n\nBernard Herrmann's eerie Theremin-laced score was recycled for the pilot episode of TV's&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/LOST-IN-SPACE/dp/B0000DC3VM/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">LOST IN SPACE</a>.\n\nBecause of the then rampant Congressional Communist witchhunts, this was Sam Jaffe's last movie appearance for almost a decade.\n\nBilly Gray (Bobby) portrayed Bud on the sitcom&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/FATHER-KNOWS-BEST/dp/B0012Q3SZ0/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">FATHER KNOWS BEST</a>.\n\nKlaatu was originally slated to be played by Claude Rains.\n\nJack Palance was suggested to inhabit Gort's robot suit. A more frail man (Martin) was chosen instead.\n\nRanked #5 on AFI's \"10 Greatest Sci-fi Films\" list.", "summary": "\"Klaatu barada nikto\"", "unixReviewTime": 1222214400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "09 9, 2008", "reviewerID": "AAFQWPKVL5XAM", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "R. Belmont", "reviewText": "One of my all-time favorites.  Simple story, well-acted, a must-see.  I hope the remake is good too.", "summary": "The Day the Earth Stood Still", "unixReviewTime": 1220918400}
{"overall": 5.0, "verified": true, "reviewTime": "02 15, 2014", "reviewerID": "A28XE9OW23DEQF", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "R. Houston", "reviewText": "This Lucy & Desi Collection is definitely a must have for all Lucy & Desi fans.\nGreat price for 3 great movies.", "summary": "Must Have", "unixReviewTime": 1392422400}
{"overall": 4.0, "verified": true, "reviewTime": "01 9, 2014", "reviewerID": "A2AGFET7URSQPG", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "paula", "reviewText": "Another chance to see them in a movie role, a little different from their TV personas!  Thoroughly enjoyed this movie.  Love to watch it over and over!", "summary": "Absolutely Love Ricky and Lucy", "unixReviewTime": 1389225600}
{"overall": 2.0, "verified": true, "reviewTime": "10 23, 2013", "reviewerID": "A3TKTO5874AQGZ", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Statistically Speaking", "reviewText": "I enjoyed The Long, Long Trailer and thought this DVD would be similarly entertaining.  To me, it was not.  The humor, the script, the story hardly kept my attention and I almost took the DVD out before finishing.", "summary": "Forever Darling", "unixReviewTime": 1382486400}
{"overall": 5.0, "verified": true, "reviewTime": "10 21, 2013", "reviewerID": "A157W22HZJY934", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "booklover", "reviewText": "I really love Lucille Ball. This is such a funny collection of movies. It made me laugh so hard. watch it.", "summary": "Funny", "unixReviewTime": 1382313600}
{"overall": 5.0, "verified": true, "reviewTime": "09 4, 2013", "reviewerID": "AWF2S3UNW9UA0", "asin": "6302241081", "style": {"Format:": " Amazon Video"}, "reviewerName": "Kindle Customer. Beth holman", "reviewText": "Are favorite married Tv could.  Do a good film I recommend for all ages.  He wants to take her to Africa for pesticide.to kill mosquitoes.  With her help some of it funny works.", "summary": "forever darling", "unixReviewTime": 1378252800}
{"overall": 5.0, "verified": true, "reviewTime": "08 1, 2013", "reviewerID": "A3OBSVI09WHTRE", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "KarlitosWay", "reviewText": "My wife's favorite movie is the long long trailer.  I think the movie is good also.  The other movie was good also.  Cheap price, quality DVDs, no problems.  They are not in HD or anything special, you can't expect that from an older movie.  But the transfer is clear and quality.  Worth getting.", "summary": "Good product", "unixReviewTime": 1375315200}
{"overall": 5.0, "verified": true, "reviewTime": "10 20, 2016", "reviewerID": "A2NM3CYDIU5NL8", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "NiceSeeingYou", "reviewText": "EXCELLENT!", "summary": "Five Stars", "unixReviewTime": 1476921600}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2016", "reviewerID": "A12PCVLV64I9AM", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "A+", "summary": "Five Stars", "unixReviewTime": 1476662400}
{"overall": 5.0, "verified": false, "reviewTime": "10 17, 2016", "reviewerID": "AWG2O9C42XW5G", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Blake Meahl  2018", "reviewText": "this is a awesome movie. this one is a lot better than the remake, don't get me wrong the remake is good but this one is better. this movie has one of the best on foot chase seen I've seen. love this movie the story is good, the acting is good and the action is good. great film. if you have not seen this movie then I recommend you do", "summary": "Point Break", "unixReviewTime": 1476662400}
{"overall": 5.0, "verified": false, "reviewTime": "10 17, 2016", "reviewerID": "AWG2O9C42XW5G", "asin": "6302256615", "style": {"Format:": " Blu-ray"}, "reviewerName": "Blake Meahl  2018", "reviewText": "this is a awesome movie. this one is a lot better than the remake, don't get me wrong the remake is good but this one is better. this movie has one of the best on foot chase seen I've seen. love this movie the story is good, the acting is good and the action is good. great film. if you have not seen this movie then I recommend you do", "summary": "Point Break", "unixReviewTime": 1476662400}
{"overall": 5.0, "verified": false, "reviewTime": "10 17, 2016", "reviewerID": "AWG2O9C42XW5G", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Blake Meahl  2018", "reviewText": "this is a awesome movie. this one is a lot better than the remake, don't get me wrong the remake is good but this one is better. this movie has one of the best on foot chase seen I've seen. love this movie the story is good, the acting is good and the action is good. great film. if you have not seen this movie then I recommend you do", "summary": "Point Break", "unixReviewTime": 1476662400}
{"overall": 4.0, "verified": true, "reviewTime": "10 10, 2016", "reviewerID": "A1ARDK9Q8E0FVP", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Toni M.", "reviewText": "The original wins.", "summary": "Vaya Con Dios Forever", "unixReviewTime": 1476057600}
{"overall": 5.0, "verified": true, "reviewTime": "10 10, 2016", "reviewerID": "A14M8WQWRN1ITF", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "jmiddle1", "reviewText": "So underrated. Great flick.", "summary": "Totally entertaining", "unixReviewTime": 1476057600}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "07 4, 2011", "reviewerID": "A40JUONF1PO8", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "Vladimir Tankhimovich", "reviewText": "1. Video quality: no better than DVD. More contrast/saturation, but same old grain. I have seen better restored movies from 1930s.\n2. No subtitles (on blu-ray!). My old DVD has captions.\n3. Instead of endless hours of special features, they should have included that brilliant scene everyone loved so much but still cut from theatrical release (see \"The Sinister Saga\").\nI am sending this half-baked disk back, will wait for a director's cut done right.", "summary": "Great movie gets yet another bad treatment", "unixReviewTime": 1309737600}
{"overall": 4.0, "vote": "10", "verified": true, "reviewTime": "06 12, 2011", "reviewerID": "A3U6XCKC4QG89V", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "W. Craig", "reviewText": "An image so vivid that unlike any previous blu-ray I have purchased to date, I had to dumb-down my monitor from \"vivid\" to \"standard\" to compensate, which is a good thing as the reduction in contrast subdues the occasional film grain which is evident quite often but short-lived, such as when Director Rush presumably zoomed in on the film negative for a close-up in post-production as an afterthought rather than having done so 'in camera' during the shoot. Though the original mix was mono, discrete surround sounds are quite evident from time to time. After enduring the poor print quality of the laserdisc pressing it's good to see Rush's beloved film get its due on blu-ray, both of which are well worth the upgrade if you're a big fan like myself, but if you're not and already have the two-disc Limited Edition, you won't find enough of a difference to warrant this upgrade to blu-ray.", "summary": "Blu-ray nicely mastered, both image and audio, but revealing of deficiencies in the original negative.", "unixReviewTime": 1307836800}
{"overall": 5.0, "vote": "7", "verified": true, "reviewTime": "06 9, 2011", "reviewerID": "A1W8QNUHI4U2FQ", "asin": "6302260973", "style": {"Format:": " Blu-ray"}, "reviewerName": "jrc", "reviewText": "Severin films offers another great title to their arsenal with THE STUNT MAN.  Great Blu-Ray presentation.  Some scenes have excessive grain, but that's inherent in the original elements.  Plus, all of the new extras, including some lengthy interviews with O'Toole, Rocco, Railsback, & Hershey.  A great value for $20.  Only gripe: why didn't someone ask O'Toole to remove those big-framed \"old man glasses\" for the interview?  Why do all older people end up in those hugh-framed eyeglasses?  LOL!  Seriously, though, that this movie was such a labor of love is reflected by the participation of most of the major players in the supplements.  I haven't seen/heard an O'Toole interview or commentary for years, and I suspect he did it for nothing.  He obviously loves this film!", "summary": "Ultimate film-lovers' movie, great Blu-Ray!", "unixReviewTime": 1307577600}
{"overall": 4.0, "verified": false, "reviewTime": "02 18, 2011", "reviewerID": "A5TZXWU8AALIC", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Syd Dithers", "reviewText": "I recently rewatched THE STUNT MAN as part of Turner Classic Movies' 31 Days of Oscar.  I remember when I first saw it when it opened back in 1980 and always wondered why it was considered a \"cult favorite\" or \"underground classic.\"\n\nThe plot is interesting and keeps the viewer guessing, all the way to the end.  Some scenes come off as sloppy, especially the one where Steve Railsback and Barbara Hershey are stumbling around with paint cans near the end.  But Peter O'Toole is great as the maniacal director who'll do anything to get his film made, even if he's also completely burned out and jaded by the process.\n\nBut I wondered why the main character was played so crazy.  Steve Railsback's expressions are so wired and crazy that I had hard time sympathizing with him.  All these years later, it just comes across as overacting.  Was it another goof from the director on the audience?  The director would do everything he could to throw his audience...even have his lead act over-the-top to show how oblivious everyone is to the illusion.\n\nI don't know.  But right now...it was distracting.", "summary": "Good Movie...but....", "unixReviewTime": 1297987200}
{"overall": 4.0, "verified": true, "reviewTime": "09 17, 2010", "reviewerID": "A281387UUS2IN5", "asin": "6302260973", "style": {"Format:": " VHS Tape"}, "reviewerName": "Beantown Jim", "reviewText": "This film was exemplary for its mature approach to film making the film industry, and the state of the contemporary zeitgeist (spirit of the times.)  I highly recommend it to any film fan or thinking person.  Period.", "summary": "A mature look at film making", "unixReviewTime": 1284681600}
{"overall": 2.0, "vote": "4", "verified": true, "reviewTime": "07 7, 2010", "reviewerID": "A196WSM71WSMTZ", "asin": "6302260973", "style": {"Format:": " VHS Tape"}, "reviewerName": "Patrick L", "reviewText": "Just as engineers design products to impress other engineers (like the unwieldy push-button gear shift on late model Mercedes cars), this movie was made by movie-making people for movie-making people and critics. A \"normal\" viewer is alternately confused and bored by a plot that moves into another plot and alternates reality with fantasy. No doubt elite purists, and even ordinary viewers, will admire O'Toole's exceptional talent that could have been utilized infinitely better.", "summary": "Not for regular viewers", "unixReviewTime": 1278460800}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2009", "reviewerID": "A3AP2MA7YIWA4F", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Rick In NorthEast", "reviewText": "Very odd, funny movie. Shows what we see is in the eye of the beholder.", "summary": "DVD movie", "unixReviewTime": 1255737600}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "09 20, 2009", "reviewerID": "A2FQ1USWVZMPD8", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "William Dakota aka Kern, Jr.", "reviewText": "I was fortunate to see this film at a press screening. The director apologized for not having enough money to have the movie in stereo. Steve Railsback was new to films. At least he was new to me. He later played Manson on TV and looked like the real Manson.\nAnyway, this film is about a movie being made and Railsback gets into trouble with the cops and ends up on the movie set and into the movie. Barbara Hershey is the female lead. The extras on the DVD tells the difficulty of making a film with a low budget. It took years to complete it. But, the wonderful thing about this DVD is it is now in 5.1 surround sound. The camera work, from the beginning to the end is wonderful. The stunts in the movie, making a movie, are wonderful. I love this movie. What more can I say?", "summary": "Peter O'Toole at his best", "unixReviewTime": 1253404800}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "07 23, 2009", "reviewerID": "A356RFKNIG043B", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "K. Swanson", "reviewText": "Rush caught the brass ring of Hollyweird and turned it into gold on this one. I saw The Stunt Man when it came out and after rewatching it last night feel that it holds up as well as any movie of its era; it still thrills and confounds and delights.\n\nThe performances are uniformly excellent. O'Toole is truly magnetic here, and you can see that he was hammered in some scenes and still pulls it off. Now that's a pro drinker! Railsback is perfect, and Hershey is mighty alluring indeed. This is the inside look at film-making that Hollywood doesn't want us to see: the egos, the drugs (watch the t-shirts and background scenes), the general insular idiocy of it all, and mainly the non-stop irony.\n\nMy only quibble is that it could be about 15 minutes shorter; it drags a bit at about 90 minutes in, and some of the shots linger a little too self-satisfiedly long, showing that even Rush was not immune to director's disease.\n\nNonetheless, SM is so brilliant in so many ways, and the script so tight, that this is truly a classic film. Could never figure why it didn't get the acclaim it deserved, but then again the market for truth has never been too huge. Perhaps a little too confusing for the average filmgoer, but then again that may be its greatest charm: one is never completely sure about what's going on. Just like life.\n\nA truly unique and enduring movie.", "summary": "A real classic, and so unusual in so many good ways", "unixReviewTime": 1248307200}
{"overall": 5.0, "verified": false, "reviewTime": "07 23, 2016", "reviewerID": "A2WN7TW3MHCVOF", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Nico J", "reviewText": "It's great ! Action placed just a great film wish it was to purchase on line amazon ! Please", "summary": "A must see for all Mr. Rutger Fans", "unixReviewTime": 1469232000}
{"overall": 3.0, "verified": true, "reviewTime": "06 27, 2016", "reviewerID": "A3T17FBDB4P37O", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Very violent but interesting concept.", "summary": "Three Stars", "unixReviewTime": 1466985600}
{"overall": 5.0, "verified": true, "reviewTime": "01 27, 2016", "reviewerID": "A1J3JC3F49RP3V", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "robert", "reviewText": "In my mind, any movie with Rutger Hauer in it is a 5Star movie  ..", "summary": "RH Fan  ....", "unixReviewTime": 1453852800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 30, 2015", "reviewerID": "AXT76HU0LY2VE", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "northcountry2", "reviewText": "I had this movie on VHS for years, but I wanted it on DVD too. (I'd also purchase it on Instant Video if it were available!). Rutger Hauer has been my favorite actor for a very long time - he plays his part  extremely well, whether is be a good guy or a bad guy. Personally, I like it when he's the good guy. This movie entertained me and kept me interested for the whole time - and that's what I'm looking for in a movie. I liked the story this movie told. 5 stars from me!", "summary": "Loved the movie - wish it was on Instant Video too!", "unixReviewTime": 1451433600}
{"overall": 5.0, "verified": true, "reviewTime": "02 17, 2015", "reviewerID": "AS80R6WJI6YLM", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Chris Holbert", "reviewText": "Completely satisfied.", "summary": "Five Stars", "unixReviewTime": 1424131200}
{"overall": 5.0, "verified": true, "reviewTime": "01 6, 2015", "reviewerID": "A1I41LGT3OK9TP", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Dale", "reviewText": "Good action movie!", "summary": "Five Stars", "unixReviewTime": 1420502400}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "08 18, 2008", "reviewerID": "ADPB8S493PYGE", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "g_vezz", "reviewText": "Some reviewers say this is dated but then again so is Star Wars. Here you get above average acting and an intelligent script. Now that is dated!\nStill most of the credit should go to Robert Wise the director and the fantastic cinematography. What beautiful lighting design. This film is mostly for Sci-Fi film buffs. And \" Gort! Klaatu barada nikto!\" is a gem. I doubt I could have kept a straight face either.", "summary": "Excellent Sci-Fi", "unixReviewTime": 1219017600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "07 30, 2008", "reviewerID": "A2BFD2MM8TTGC5", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "E.M. Tennessen", "reviewText": "It's amazing how timely the message of this movie still is. As I watched it, I realized how much it is not science fiction at all. Its observations and conclusions about humanity are still very relevant, and I found myself thinking about them even more as we live in these troubled times. The characters are very relatable, and the bad guys are not who you would think they'd be.\n\nI heartily recommend this movie for the following:\n\n--Great acting--Michael Rennie's Klaatu may be human-looking, but he's anything but human\n--Wonderful special effects, considering the year it was made--even my teenagers were impressed, and they usually abhor black and white films\n--Christian overtones\n--Inherent messages (see above)\n--Plus, it's interesting from a period film viewpoint.\n\nAlthough the movie deviates from the original story on which it was based (\"Farewell to the Master,\" by Harry Bates), it retains the suspense, human terror, and technological/ethical questioning of the original tale.\n\nIt would be interesting to see this movie re-made with an environmental twist, with Klaatu landing and then saying, \"If you don't take care of the Earth, it's going to be taken away from you.\"\n\nWatch this movie; it will make you think.", "summary": "It will make you think", "unixReviewTime": 1217376000}
{"overall": 5.0, "verified": false, "reviewTime": "07 21, 2008", "reviewerID": "A1VZLLDNLURGJB", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Keith Mirenberg", "reviewText": "I agree with almost all Amazon reviewers about this film. It was a great old movie that earns five stars in my book. I am sorry that I never got to see this film on the big screen, but the restored and enhanced DVD transfer was so good that it held up well on my large screen HDTV.  Excellent documentaries were included with the DVD about the making of the film and the materials that film collectors have accumulated over the years from this great movie.\n\nDuring her interview Patricia Neal commented that her biggest problem during filming was keeping a straight face when required to say her now fameous line: \"Gort, Klaatu barada nikto\".  You would never have known this from the final cut.\n\nI only have a couple of comments to make about seeing the film in a fine digitally enhanced DVD format (on a 52\" LCD screen):\n\n1) As Gort carried Patricia Neal towards the saucer I noticed for the first time a network of (not so fine) cables supporting her weight.\n\n2) In the saucer the foam rubber Gort suit laces were clearly visible on the front of the garment(for a fraction of a second) as Gort moved from right to left on  screen exiting the saucer.", "summary": "Gort, Klaatu barada nikto", "unixReviewTime": 1216598400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "07 14, 2008", "reviewerID": "A2CK0VXUDVXGMN", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Vance", "reviewText": "Still a timeless classic of sci fi movie making at its best. I dread the remake, out this December, and what modern view will be with. It is already miscast with Keenu Reeves as Klaatu.  Ugh.  David Bowie would  have been a better choice.  The message is simple but clear and still applies today.  We are a stupid race of sentients destined for obliteration.  We spend trillions on tanks and fighter jets and nukes while people starve.  Gort should have a field day leveling the planet.  Good riddance humanity.", "summary": "Message for Today", "unixReviewTime": 1215993600}
{"overall": 5.0, "vote": "17", "verified": true, "reviewTime": "06 22, 2008", "reviewerID": "AN8M401S8Y6DA", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Mike", "reviewText": "Earlier today an unidentified flying object landed at our nations capital.  Apparently an alien who looks just like us emerged from the ship speaking perfect English and uttered the slogan that he comes in peace.  Of course, like any wise American we shot him instantly while offering our own, to quote House of Pain, slogan, eat you up like some butter cups from Reeses I come in peace but you'll leave in pieces.\nFollowing this at exactly noon time today we lost power for 30 minutes.  Do you realize that for thirty minutes we were unable to launch nuclear weapons and missiles.  I don't know if America is prepared for the devastation of not being able to launch missiles could cause.  For those 30 terrifying minutes our cars could not pollute the environment.  The radio and television newscasters could not promote fear and panic.  IT WAS TERRIBLE!\nHey Mike, What was that great invention.\nOh, basically the cure for stupidity.\nUh, ok.  Anyway, what time is American Idol on tonight?\nSigh.\nIn all seriousness this is one of the greatest science fiction films I've ever seen.  It's premise is like when Rudy Huxtable on the&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/The-Cosby-Show-Season-1/dp/B0007ZSHR6/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Cosby Show - Season 1</a>&nbsp;tells her little fairy tale about war and ends it by saying STOP, with a lot more science involved but unfortunately as much fiction.\nThe film is also rated G.  Kids got to see some real movies back then with meaning.  Even&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Creature-From-the-Black-Lagoon/dp/0783240953/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Creature From the Black Lagoon</a>&nbsp;was rated G.  I'd take these two over Hannah Montana.\nDirected by the versatile four time Oscar winner Robert Wise who also directed&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/The-Haunting/dp/B00009NHB6/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Haunting</a>&nbsp;and&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/West-Side-Story-Special-Edition-DVD-Collector-s-Set/dp/B00008972S/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">West Side Story (Special Edition DVD Collector's Set)</a>&nbsp;to name just a couple.\n\nDVD FEATURES:\nThe Picture looked pristine in black and white.  The negative review on here had to be for another version or something was wrong with that persons television.  Also sounded great and was THX certified.\n\nAudio Commentary by Robert Wise and Nicolas Meyer - 70 Minute \"Making the Earth Stand Still\" Doc - Movietone Newsreel (1951) - Restoration Comparison - 5 Still Galleries - Shooting Script - Theatrical Trailer - Full frame format (Aspect Ration 1.33.1 )", "summary": "The Greatest Inventio *** We Interrupt This To Bring you Important News.  DVD Features below.", "unixReviewTime": 1214092800}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "06 13, 2008", "reviewerID": "AG2HZ82H9F5LZ", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Colonel Samuel Thursday", "reviewText": "This is an excellent film.  However, despite the important message it delivers at the end, I am of the opinion, that films in any age should be used for the sole purpose of entertainment and not for the delivery of political messages.  Morality plays are a different issue and I can see where they may fit into film making.  Otherwise, I highly recommend this film because it is extremely well acted, well directed and well written; and most importantly, very entertaining.", "summary": "Stay Out of Politics", "unixReviewTime": 1213315200}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "06 3, 2008", "reviewerID": "A2SQGC708613E4", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Maxwell Johnson", "reviewText": "I find it difficult to believe that individuals continue to find this film a stimulant to simple-minded political critique.  One would think, to read some of the reviews here and elsewhere, that we were still in the middle of the Cold War.  Klaatu and Gort are, to these poor, befuddled souls, archetypes of the Evil Empire, intent on subjugating the people of earth into a huddled, quivering mass of terrified obedience.  I wonder if they bothered to listen to the dialogue...\n\nThe quality of the restoration is not bad at all.  The sound track, in particular, sounds quite good.  While one can detect some video artifacts, they should only bother those folk who watch TV screens primarily to detect moires and jaggies.  For the rest of us, the appearance is quite good enough, thank you.\n\nThe plot is laden with the usual improbabilities.  Persons who cannot deal with such probably ought not view science fiction.  Only Patricia Neal's obligatory screaming seemed to me contrived and facile.  Otherwise, the writers simply did what writers must do to make a complex story fit within the time frames of American movie-making.\n\nWhen all the carping and griping is done, this remains THE film by which science fiction of its period will be judged.  It ranks among the very best sci-fi films of all time; a position that it amply earns.", "summary": "Let the naysayers say their nays", "unixReviewTime": 1212451200}
{"overall": 4.0, "verified": false, "reviewTime": "05 4, 2008", "reviewerID": "A2ESQGLREDKK0J", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "J W Logan", "reviewText": "I read the only review and my copy of The Day The Earth Stood Still is an exact copy of the original film. I know that because I saw the film in theatre when It was released in the 1950's. The DVD I have is 20th Century Studio Classics and states \"Winner Golden Globe 1951 on the cover. So If you want a copy of the real deal I have it.", "summary": "The Day The Earth Stood Still", "unixReviewTime": 1209859200}
{"overall": 4.0, "verified": true, "reviewTime": "09 20, 2016", "reviewerID": "A1VLK3ZGA3Z9CL", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Sandra Goldschein", "reviewText": "good", "summary": "Four Stars", "unixReviewTime": 1474329600}
{"overall": 5.0, "verified": true, "reviewTime": "06 5, 2013", "reviewerID": "A1ISTR339HDIBG", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Dallas B", "reviewText": "I love Lucy and Desi and their movies where the best. This brought me back to a happy time in my life and had me smiling for hours after.", "summary": "great movies", "unixReviewTime": 1370390400}
{"overall": 5.0, "verified": true, "reviewTime": "05 26, 2013", "reviewerID": "A1AERSZKUGYGK6", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "royal candace", "reviewText": "good stories and great slapstick humor as performed by the royal couple of  this genre! these films are \"feel good\"for sure!", "summary": "i love desi & lucy!", "unixReviewTime": 1369526400}
{"overall": 5.0, "verified": true, "reviewTime": "04 13, 2013", "reviewerID": "A2XVWMOCVL63VV", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Marilyn Rittinger", "reviewText": "I Love Lucy. Thanks for the 3 DVD's. I will treasure them. You deserve the 5 stars. They are great", "summary": "Lucy", "unixReviewTime": 1365811200}
{"overall": 5.0, "verified": true, "reviewTime": "02 24, 2013", "reviewerID": "A35QXBGHI6M4IV", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "L. Nash", "reviewText": "I love to watch this dvd and this is a great classic. I got this faster than I expected. I recommend this to anyone who loves Lucy.", "summary": "The Lucy and Desi Collection", "unixReviewTime": 1361664000}
{"overall": 4.0, "verified": true, "reviewTime": "02 6, 2013", "reviewerID": "A1U3FRM4VW0ZCT", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Creature Feature Fan", "reviewText": "My Favorite Is The Long Long Trailer From These Two Great Actors --- This Movie Is Good In Its Own Way ----But Not Like The First Movie They Made ---  More Like The I Love Lucy TV Show ----Still Worth A Watch --- In Color", "summary": "A Good Movie", "unixReviewTime": 1360108800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 26, 2009", "reviewerID": "A22SB9HXP1XSXF", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Su Co", "reviewText": "I was surprised to find a second disk containing a delightful documentary. Unfortunately I went out and bought the documentary at the same time I ordered this DVD.", "summary": "The second disk is a delightful documentary", "unixReviewTime": 1240704000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "05 11, 2008", "reviewerID": "A3IP0R4JOD4R5G", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "the masked reviewer", "reviewText": "By 1980, the year THE STUNT MAN was released, Peter O'Toole and his peers -- that infamous troupe of besotted British actors which included Richard Burton, Robert Shaw and Richard Harris -- were considered anachronisms by Hollywood. Fast living had aged them beyond their years, but more to the point, these classically trained Europeans, their mannered acting styles designed to project to the last rows of the Old Vic, seemed hopelessly dated compared with the introspective naturalism of America's latest generation of rising Method actors, led by De Niro. For the most part, this lot was best remembered by American audiences for their historical costume dramas and World War II epics of the '60s -- the kinds of films nobody was making anymore.\n\nFor O'Toole in particular, the glory days of LAWRENCE OF ARABIA were long gone -- his screen work had recently included TV movies and the big-screen abomination CALIGULA. THE STUNT MAN, an ambitious black comedy about filmmaking and paranoia, resurrected O'Toole's career and garnered him his sixth Best Actor Oscar nomination. The irony in this is that O'Toole's comic performance as a half-mad movie director willing to risk everything to finish his film is quite purposely based on the same flamboyant dramatics that marked the actor as old-world and out of date.\n\nO'Toole's Eli Cross has three days to wrap his antiwar film, with both his ego and his career on the line, and so he slows for nothing, not even the accidental death of a stunt man. (Real-life directors have gone as far in pursuit of their goals.) In creating his character, O'Toole has mixed in touches of such directing legends as John Huston and David Lean, for whom he had worked. But Cross is no mere parody. Rather, Cross plays as a composite of Peter O'Toole's greatest hits: there are shades of Henry II, head of that ancient English dysfunctional family, whom O'Toole had played to perfection in both BECKET and THE LION IN WINTER. Well aware of the aptness of the director-as-king metaphor, O'Toole invests Cross with Henry's regal magnetism -- part warrior, part diplomat, part schemer.\n\nBut in another sly stroke of insight, O'Toole draws even more heavily on his role as Jack, the paranoid schizophrenic nobleman who's certain he's Jesus Christ in THE RULING CLASS. Standing on a lofty perch above his cast and crew, Cross booms out in a voice that needs no megaphone: \"We must have this shot!... I thereby order that no camera shall jam, and no cloud pass before the sun!\" O'Toole grins crookedly -- he knows Cross is only half-serious -- but he plays his megalomaniacal director as a man who wants his crew to believe he is the closest thing to a deity they're likely to meet. \"If God could do the tricks we can do, he'd be a happy man,\" Cross insists, and it's O'Toole's delivery, brimming with a crazed self-confidence, that makes this the film's tag line.\n\nO'Toole makes Cross larger than life, a screen presence whose hypnotic charm, more than his temper, reputation or title, is the true key to the manipulative power he wields. \"I can't figure it out,\" says one character, an on-the-lam criminal whom Cross seduces into replacing the dead stunt man and risking his life on a movie set, \"I can't take my eyes off the son of a bitch.\" It is an apt description of Cross the director, and a fitting tribute to O'Toole the actor, who roused himself from career torpor for one glorious performance which, in recalling the best moments of a bygone era, proved how compulsively watchable an old ham can be.", "summary": "A Good Film Elevated To Greatness By A Brilliant  Peter O'Toole", "unixReviewTime": 1210464000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "02 8, 2008", "reviewerID": "A1H1BUM6QZ4ROZ", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Trevor William Douglas", "reviewText": "What a ride! An excellent film that grabs you from the first frame and keeps you glued to the screen for the entire 130 minutes. I will not attempt to explain the plot, suffice to say that you will want to watch the film again and again. The bonus disc is almost as long as the film and is brilliantly photographed. A must have for anyone interested in timeless entertainment.", "summary": "Fantastic Film Loaded with Amazing extras!", "unixReviewTime": 1202428800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 29, 2007", "reviewerID": "A1W5U6443BKM84", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Geoffrey F. Arnold", "reviewText": "This is one of two O'Toole movies to own of his later work. The other is \"My Favorite Year\", which I reviewed as well.\n\nWhat can I say. This is a nice ride into the world of Alice in Wonderland by a reluctant passenger who actually becomes part of that world by the end of the story. A spoiler? Hardly.\n\nThis film languished on a shelf for two years before being released, so I am told. It almost didn't see the light of day. Thankfully, someone inquired about it and they wanted to see it. The rest, as they say, is history.\n\nLucky isn't the only one who benefitted (you'll get this when you see the film).", "summary": "Peter O'Toole is great surrounded by a great cast.", "unixReviewTime": 1198886400}
{"overall": 5.0, "verified": false, "reviewTime": "07 10, 2007", "reviewerID": "A10ODC971MDHV8", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "John Farr", "reviewText": "Part of the great appeal of this crazed cult classic--which finds a paranoid, confused young man thrust into the maniacal world of filmmaking--is the way screenwriter Lawrence B. Marcus plays with our understanding of \"reel\" narrative, like a proto Charlie Kaufman. Based on the novel by Paul Brodeur, this kooky, wit-fueled romp pairs Cameron with sexy starlet Nina Franklin (Hershey), who also happens to be Eli's one-time lover. In one of his sharpest and funniest roles, O'Toole is an unstoppable fount of clever deviance and saucy bon mots. If you're in the mood for a frenetic farce about the thin line between fantasy and real life, make way for \"The Stunt Man.\"", "summary": "The Stunt Man", "unixReviewTime": 1184025600}
{"overall": 3.0, "vote": "2", "verified": false, "reviewTime": "03 3, 2007", "reviewerID": "A2R4XG0L7Z01V8", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Meesha", "reviewText": "I've been informed many times that I should watch this film. To save an argument, I put it in the DVD player. While watching it, I did feel it was a little too long, and some scenes could have been cut so easily, but it's one of the strangest films I've seen in a long time. I think with a couple more viewings I could understand it more fully, and I don't think anyone will every FULLY understand on the first viewing.\n\nBut what you get is one of the most innovative and lesser known movies around. While the 80s were full of the Rat Pack, and high school movies, this one may have slightly slipped under the radar, and has become, judging by some of the reviews, what can only be described as a cult classic.\n\nPeter O'Toole gives a great Oscar worthy performance (he was robbed!) as the egomanical director of a WW1 film, who will do absolutely anything, perhaps even murder someone, in order to protect his film. He'll do whatever is necessary to get a precious shot and the viewer feels like he needs to know where his motives lie. You see him place his lead character, Cameron, in many different stunts, each one more dangerous than the other, including the most memorable one, running across the rooftops, being chased. You do get the feeling the director wants to capture death on film, and since Cameron killed (and replaced) the other stuntman, he kinda owes the director a favour. I didn't like Cameron that much, but it wasn't him, it was after he dyed his hair, he reminded me so much of a guy I knew at school, I found it very difficult to watch him.\n\nI think perhaps why this movie never got the attention it deserved, is because how on earth do you categorise it? It could fit under so many different film genres that it's difficult to describe the film in any sense making way. Especially, in a review, which I've had so much trouble writing.\n\nWhat I found difficult about this film was the perspective it was told from. It's told from the perspective of Cameron, but it's NOT always his point of view, and my head was spinning after a while trying to keep up with it all. It does take some patience to watch it and understand it. What also put some people off is that it took a mere nine years to get to screen and even then it only got a limited release. This limited edition DVD is packed with extras, although it did remind me more of a video cassette case, rather than the slimline DVD that is out there now.\n\nIt's definitely a film worth picking out, if you're tired of the same old rom-coms, horror movies and action movies. This is a movie with a difference.", "summary": "Completely different to any other film out there", "unixReviewTime": 1172880000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "01 13, 2007", "reviewerID": "A2SIXKZZ1MOQDG", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "James J. Rossignol", "reviewText": "The Stunt Man features Peter O'toole as a megalomaniac director exploiting an unsavory character portrayed by Steve Railsback.  You get a glimpse of the art of stunts and the director's callous attitude towards stuntmen.  The director is the star of a war epic that has little to do with reality.  His skewered vision of war and his approach towards directing his epic go leaps and bounds beyond reality.  This film has a fine cast of characters that give some gravitas towards the story.  It is a thoroughly enjoyable romp as criminal turns into a vehicle for cinema.  The director and stuntman can't agree on who is the star of this picture.  The tension is palpable as the stuntman faces increasing danger.  In the end they live to see another day.", "summary": "Cult Classic", "unixReviewTime": 1168646400}
{"overall": 4.0, "vote": "5", "verified": false, "reviewTime": "11 12, 2006", "reviewerID": "A39IBJB2PBVC7I", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Alistair McHarg", "reviewText": "It's easy to see why The Stunt Man has stayed around so long and developed a devoted cult following - it's great fun.  Richard Rush has created an amusing hall of mirrors that relies on the very essence of film - illusion.  Of course, here there are layers of illusion and we're not exactly sure of who is in on the joke and when they've figured it out, which makes it that much more entertaining.\n\nWhile it's inadvisable for writers to write about writers, and for filmmakers to make movies about making movies, it can be done.  Serious students of film looking for deep meaning and symbolism should bypass The Stunt Man altogether and go straight to Truffaut's Day For Night, an extraordinary bit of cinema that blurs the line between celluloid artifice and reality brilliantly, using one to inform the other.  I like to think Mr. Rush did not have such lofty goals in mind for The Stunt Man.  For him, the - What is real? - question is merely a device to advance plot and maintain interest, which it most certainly does.\n\nThe improbability factor in The Stunt Man is very high; the picture is made plausible and held together through the offices of Peter O'Toole, whose performance is absolutely perfect.  O'Toole is an amazing actor; as director Eli Cross he is megalomaniacal, nearly mad, vain, narcissistic, staggeringly manipulative, and at least a little bit brilliant, in short, close to the popular image of a real director.  While it is easy to focus on his puppet-master control of all events, there are many scenes revealing how he fears the various disasters that may befall his project, not the least of which being his ability to lead.\n\nThe Stunt Man for whom the picture is named, Cameron, is played amateurishly by Steve Railsback.  (This may explain the long list of movies no one has seen on Mr. Railback's bio.)  It doesn't matter, everyone else in the cast is so good, especially Barbara Hershey, that the film easily survives the damage Mr. Railsback inflicts.  Indeed, it would be worth seeing the picture just to witness the innumerable nameless stuntmen at work, absolutely great.  Not a picture for the art house, this one's for the fun house.  Recommended.", "summary": "The Reel Deal", "unixReviewTime": 1163289600}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "09 12, 2006", "reviewerID": "A319SKSB556033", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Inspector Gadget", "reviewText": "This was director Richard Rush's dream project and it took him nine years to get it on the screen. And, of course, it would! It's multi-layered, original, funny and packed full of story and circumstance that makes you think.\n\nWhy would any studio want to touch it? Fox even sat on it for two years before giving it a limited release. Now, Anchor Bay has created the ultimate DVD and I urge you to buy it. The Stunt Man is a movie you'll never forget and even on its umpteenth viewing, still manages to be as intriguing as the first.\n\nIt is a story told from the view of Cameron (Steve Railsback), a Vietnam vet on the run from the law. He stumbles onto the set of a WWI movie and accidentally kills a stunt driver. The director of the movie is the eccentric and megalomaniacal Eli Cross (Peter O'Toole, in one of his best ever performances), who takes Cameron under his wing and protects him from John Law, as long as he keeps his mouth shut about the accident.\n\nCameron practices to be a stunt artist and takes the place of the man he killed. But as the movie shoot becomes more elaborate and dangerous, he falls in love with the leading lady (Barbara Hershey) and starts to suspect that Eli is trying to capture his death on film.\n\nAlthough it seems nasty, the movie is wonderfully light-hearted and the outrageous stunt scenes are backed up by a joyous score by Dominic Frontiere. I've been humming that theme since I was 12-years-old. A long scene with Cameron running over a rooftop, as biplanes attack and enemy soldiers give chase, is the stuff of legend. There is a great comic sense of humor in watching them trip over each other, fall off and get blown up.\n\nJohn Law do not back down on their suspicion of Eli and, through half-heard conversations and eavesdropping, Cameron's paranoia becomes increasingly justified. Because the movie is seen through his eyes we never quite know what is going on with Eli. Is he a madman, or just a crafty director? Would you believe that O'Toole based his performance on his experiences with David Lean?\n\nWhy he never won an Oscar - it went to Robert DeNiro for Raging Bull - is beyond me. He truly gives the performance of his career, far exceeding even Laurence of Arabia. It also sucks that Rush never won for Director, or Adapted Screenplay. Had he been awarded the golden statuette, maybe he would have received more recognition. He's clearly a better filmmaker than most of today's hack artists.\n\nYou simply have to see The Stunt Man. It's an overlooked gem and, despite the wide praise it received, it has never really reached a large audience. Now is definitely the time to rediscover this forgotten classic.\n\nFilmed in standard widescreen, the 1.85:1 anamorphic picture exhibits varying degrees of quality. Some scenes are a bit grainy and a tad awkward, while others are clear, with beautiful blue skies and fleshtones. Even the soft-focus scenes still retain a golden shine to them. It may not be perfect and consistent, but it's a good transfer, considering the source material.\n\nTaken from the original mono tracks and fully remastered, the Dolby/DTS 6.1 soundtracks are fantastic. The awesome score comes through with full force and takes over the soundfield. Deep bass is reserved for explosions and the rumble of car engines. Dialogue is still mono in nature, but a good deal of surround effects, such as circling helicopters and planes, make the soundfield come alive. Certainly not up to the standards of modern soundtracks, such as Superman Returns or X-Men III, but still the best The Stunt Man will ever sound.\n\nThere is a Commentary taken from long interviews with the participants. Some of them speak together and interact with each other, but you can easily tell that the track has been edited to make a whole, rather than one continuous session. But it's a great track, full of info and stories. Usually, I hate listening to commentaries, but this one is cool.\n\nThe 114 minute documentary, The Sinister Sage Of Making The Stunt Man, is directed and hosted by Rush as he explains every single (of many) problems he encountered from absolute beginning to absolute end. This is a movie in itself and features so many difficulties similar to those Eli Cross had to deal with and with just as much irony and tragic studio decisions as the WW I movie within The Stunt Man. It really is an interesting back-up story about what is happening on the flip side of reality. Or fiction. Depending on the angle you're watching from.\n\nStill galleries of the shoot and of the promotion art and original poster ideas and the full screenplay and three trailers are also included.", "summary": "The truth only depends on the angle you're watching from.", "unixReviewTime": 1158019200}
{"overall": 3.0, "verified": false, "reviewTime": "02 3, 2006", "reviewerID": "A1ICSYVTC8R0GN", "asin": "6302260930", "style": {"Format:": " VHS Tape"}, "reviewerName": "shinedownfan", "reviewText": "1992 Royal Rumble\n\nJanuary 19, 1992\n\nKnickerboxer Arena\n\nAlbany, New York\n\nNew Foundation V. Orient Express\n\nGood opener that got the crowd into it. The New Foundation win. ***1/4\n\nWWF Intercontinental Championship:\n\nThe Mountie (Champion) V. \"Rowdy\" Roddy Piper\n\nok match that saw Piper winning his olny WWF Gold. WOW. Thats weird to think about. *3/4\n\nBushwaackers V. Beverly Brothers\n\n13 minutes and 57 second of boringness and than 3 second of it's about time as the wackers win. DUD those 3 second were the 3 count.\n\nWWF Tag Team Championship:\n\nLegion Of Doom (Champions) V. Natural Disaters\n\nboring match that had the Doom getting countedout for no reason. *1/2\n\nRoyal Rumble Match for the WWF Championship:\n\nGod, I love Pat Patterson...wait...i don't mean sexually...i mean...well, you know what I mean. Excellent booking and finally, someone who is not Hogan wins. Ric Flair enters number 3 and wins the Rumble and the WWF Championship! Yes...Yes! four words...BEST RUMBLE MATCH EVER. *****\n\nOverall, a forgetable show except the rumble match which is the best rumble ever.", "summary": "You've Got To Be Fair To Flair!!!", "unixReviewTime": 1138924800}
{"overall": 2.0, "verified": false, "reviewTime": "12 24, 2004", "reviewerID": "A2PRAM17169E0I", "asin": "6302260930", "style": {"Format:": " VHS Tape"}, "reviewerName": "jrkg30", "reviewText": "This PPV was bad.  The vacant World Title was decided in the Royal Rumble match.  The undercard was horrible.\n\nThe Mountie vs. Roddy Piper for the IC Title.  This was a boring match but the only good thing about it is that Roddy Piper finally wins a title. (2/5)\n\nLegion of Doom vs. Natural Disater for the World Tag Team Titles.  This match was utter garbage.  The Legion of Doom should have faced somebody better.  The Natural Disaters take a win by countout. (1/5)\n\nNew Foundation vs. Orient Express was the best match opf the night so far and that's not saying much but still it was very good.  The New Foundation picks up the win. (3.5/5)\n\nBeverly Brothers vs. The Bushwhackers was as boring as boring gets and I literally almost fell asleep.  The Beverly Brothers win and I don't care. (0/5)\n\nRoyal Rumble Match for the World Title.  Everybody says this was the greatest Rumble ever nope that goes to 2004 believe it or not.  Flair wins the Rumble and he is the new World Champion. (2.5/5)\n\nOverall this PPV is very boring and it will not entertain you so just don't even rent this garbage.", "summary": "Vacant Title in the Royal Rumble!!", "unixReviewTime": 1103846400}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "11 4, 2004", "reviewerID": "A3N0AXNEZVE686", "asin": "6302260930", "style": {"Format:": " VHS Tape"}, "reviewerName": "Round Hound", "reviewText": "This WWF Royal Rumble took place in Albany, New York, in January of 1992 where, for the first time, this year's winner would lay claim to the vacant WWF World Championship. Also, among the other four matches on the card, the Mountie defended the WWF Intercontinental Title vs. Roddy Piper and the Road Warriors put the WWF Tag Team Championship up against the Natural Disasters. In all, the rumble alone gave WWF fans their absolute money's worth.\n\n1. New Foundation (Jim Neidhart & Owen Hart) vs. the Orient Express: 3 stars ..... In a slightly above-average match, the Hart boys (despite their gaudy costumes) display some solid in-ring chemistry together as they manage to deep-six the Express.\n\n2. Roddy Piper vs. I-C Champion The Mountie: 3 stars ...... After a flashback to Bret Hart's recent title loss, Piper easily blows past the Mountie and Jimmy Hart to win his first and only WWF gold. While the match is relatively decent, it is also heavily pushed that Piper will be the first-ever competitor to have a chance at winning the I-C and World Titles on the same night.\n\n3. Bushwhackers (with a geek) vs. the Beverly Brothers (with Lanny Poffo): A total zero ...... Watching a blank screen for 15 minutes is far more rewarding than forcing yourself to sit through this awful match. It is recommended that you immediately hit your fast-forward button when this one comes across your tv screen.\n\n4. WWF World Tag Team Champions: The Road Warriors (aka the Legion of Doom) vs. the Natural Disasters: 2 stars .... Not even the Warriors are able to drag much excitement out of this routine match with such inferior competition (when the Nasty Boys or the Powers of Pain could have been available). The dismal Disasters take the win with a dubious count-out and feel cheated afterwards. You should, too.\n\n5. The Royal Rumble participants: Hulk Hogan, Sid Vicious, Ric Flair, new I-C Champion Roddy Piper, the Undertaker, Randy Savage, Jake Roberts, Kerry von Erich, the British Bulldog, Hercules, the Warlord, Shawn Michaels, Tito Santana, Mike Rotundo, Ted DiBiase, Big Bossman, Sgt. Slaughter, Nikolai Volkoff, Jimmy Snuka, Greg Valentine, Rick Martel, Repo Man, the Nasty Boys, Hacksaw Duggan, Haku, the Barbarian, the Berzerker, Virgil, and Skinner.\n\n5 stars ...... Just about every major WWF star of the time (minus Bret Hart & the Road Warriors) makes an appearance sometime during the match. The in-ring chemistry among the wrestlers is outstanding from beginning to finish, especially Flair's willingness to take almost everyone's best shots during his hour-long stay in the rumble. In the end, it comes down to the four men who would headline the double main event at Wrestlemania VIII a few months later.\n\nAs a side note, announcer Bobby Heenan's ringside commentary, which alternates between hyperventilating and flagrant cheering for Flair, is really amusing. The drawback is: the announcers end up so heavily hinting at who the eventual winner will be that it becomes a foregone conclusion.\n\nIf you are able to find this vhs for a reasonable price, it is well worth the investment to see some of the best WWF players ever assembled in one match for the most valuable prize in pro wrestling.", "summary": "Royal Rumble 1992: For the WWF Championship", "unixReviewTime": 1099526400}
{"overall": 4.0, "vote": "5", "verified": false, "reviewTime": "09 2, 2003", "reviewerID": "A5DIAZ5GT3MC", "asin": "6302260930", "style": {"Format:": " VHS Tape"}, "reviewerName": "Crazy Jim", "reviewText": "Back when the WWF still understood the significance of the Royal Rumble event. The once classic hour-long battle royal really hasn't been much since the emergence of the \"Attitude\" era but in 1992, it wasn't just about which big-name stars could clear the ring of all the mid-carders. To those who aren't familiar with the pre-Austin WWF, this is a must-see.\nRic Flair gave an \"Ironman\" performance here. The commentary was on point here as well as Bobby Heenan's blatantly-biased broadcasting made for some amusing moments as he and Gorilla Monsoon trade shots back and forth. This was long before there was so much emphasis on commentators spending the whole show talking about one or two big main event wrestlers until they arrive in the Rumble. Clearly, Hulk Hogan is the big favorite here but the broadcasters take the time to acknowledge other feuds and storylines such as the one between the Macho Man and Jake Roberts and so on. This was one of the last great classic Rumbles before the WWF started going the predictable route. This was also the first and only Royal Rumble where the winner would get the WWF Title, a strange stipulation though it made it that much more intruiging, and the last one before they began rewarding the winner with a shot at the WWF Title at Wrestlemania.\nThe undercard for the '92 \"Rumble\" was not one of the better ones though Roddy Piper's only title win is a plus. He comes in as a substitute for Bret Hart, who is out due to illness, to challenge The Mountie for the Intercontinetal Title. There are also two tag team matches, one of which features the short-lived \"New Foundation\", a tag team featuring Owen Hart and Jim Neidhart.\nIf you can find Royal Rumble 1992 at any video store, I recommend that you pick it up.", "summary": "Royal Rumble 1992 Review", "unixReviewTime": 1062460800}
{"overall": 4.0, "verified": false, "reviewTime": "05 8, 2002", "reviewerID": "A31YZPP738T2EB", "asin": "6302260930", "style": {"Format:": " VHS Tape"}, "reviewerName": "Dustin Dunaway", "reviewText": "The Man made his first appearance here.  That is all ye need know.\nWe start with the New Foundation vs. Orient Express - The New Foundation was OWEN HART~ and Jim Neidhart.  The Orient Express used to be a good tag team by the name of Bad Company.  Neither of them are from the Orient.  This is a very solid match with Owen showcasing his stuff.  That's always good to see.***3/4\nIC Title - The Mountie vs. Roddy Piper - Not a good match by any means, but Piper was so popular at the time it was nice to see him get his first (only?) title.  The Mountie fluked into the title when Bret Hart got injured days before.* match **** nostalgia.\nBeverly Bros. vs. Bushwhackers - Ecch!  Fast forward.\nRoyal Rumble - The title was held up a month before so this is for the WWF Title.  Undertaker and Hogan were given \"preferential treatment\" since they were feuding over the title.  Ric Flair made his debut a few months earlier with the NWA Title in tow.  He claimed to be the REAL champion.  Bobby Heenan became his manager and Mr. Perfect was the executive consultant.  Heenan is announcing tonight and is hilarious in his blatant cheering for Flair (who draws #3 btw).  This is an absolutely awesome performance by the best in the business.  The Rumble Match is the only real reason to buy this.  It is the best rumble ever and one of the best matches the WWF has ever produced.  Period.  The Foundation/Orient Express is serviceable, but not really worth going out of your way to find.\nHopefully, the WWF comes to its senses and releases the previous Royal Rumbles much like they did with Wrestlemania in 1999.\nGreat match, but not really worth the \"rental only\" price.", "summary": "Best Rumble Main Event from a bad period for WWF", "unixReviewTime": 1020816000}
{"overall": 5.0, "verified": true, "reviewTime": "03 1, 2018", "reviewerID": "A2YHVSGH6OS8QT", "asin": "6302254132", "style": {"Format:": " Blu-ray"}, "reviewerName": "The Ancient Gamer", "reviewText": "If you like your comedies with a dash of sweet sentimentality then this is your movie! Michael J. Fox has never been better!", "summary": "A true Rom-Com!", "unixReviewTime": 1519862400}
{"overall": 5.0, "verified": true, "reviewTime": "01 28, 2018", "reviewerID": "A6J2KLVJ5YKRZ", "asin": "6302254132", "style": {"Format:": " Blu-ray"}, "reviewerName": "HumGuy", "reviewText": "One of my favorite Michael J. Fox movies.  Glad it got a good transfer to Blu Ray", "summary": "Five Stars", "unixReviewTime": 1517097600}
{"overall": 5.0, "verified": true, "reviewTime": "01 24, 2018", "reviewerID": "A1FMQY51MJFEJX", "asin": "6302254132", "style": {"Format:": " DVD"}, "reviewerName": "JB", "reviewText": "FEEL GOOD MOVIE", "summary": "Five Stars", "unixReviewTime": 1516752000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "01 8, 2018", "reviewerID": "A2G6W7HPS2E9P1", "asin": "6302254132", "style": {"Format:": " Blu-ray"}, "reviewerName": "Richard H. Burk", "reviewText": "ANOTHER OF FOX'S BEST MOVIES, MAKES YOU ROLL IN THE AILES LAUGHING! GREAT TO HAVE IT IN BLU RAY!", "summary": "SO FUNNY I ROLLED OFF THE COUCH!", "unixReviewTime": 1515369600}
{"overall": 5.0, "verified": true, "reviewTime": "12 25, 2014", "reviewerID": "AN08HFRHB54FB", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Charles A. Crosby", "reviewText": "Great movie wish it was on blu ray.", "summary": "5 stars", "unixReviewTime": 1419465600}
{"overall": 1.0, "verified": true, "reviewTime": "11 29, 2014", "reviewerID": "ARDPWWKN8XFZO", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Tank 247", "reviewText": "Silly movie.", "summary": "One Star", "unixReviewTime": 1417219200}
{"overall": 4.0, "vote": "5", "verified": false, "reviewTime": "09 24, 2014", "reviewerID": "A25J8XGWJUPQYB", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Mikhail", "reviewText": "This is a really well done movie.  First of all, Joan Chen was not in this movie.  I got this first on video when it came out.  It is good enough to see about 30 times without ever getting bored.  Hauer is a chameleon- he;s either a really good guy or a really bad guy.  Hauer likes playing evil guys as a didactic lesson.  In real life, he is one of the most down to earth, very brilliant and funny men you will ever get to meet, if you get the chance.  H e runs an independent film school in the Netherlands. Early in his career, he was marketed as a sex symbol \"tall, blonde, blue eyes\"  and later marketed for his talent.  He has worked with Stallone, Christian Bale, etc.  He has worked in many countries speaking native languages.  Hauer is a multi linguist from the Netherlands who inflects a broad newscasters'''''' ideal Midwestern dialect. He has done everything from bounty hunter films to soldier hero.  He has worked with Joan Chen, Vince D'nofrio, Michelle Pheiffer, Eric Roberts, and many known stars....  In the Netherlands he is an icon.  He devoes his time to an organization he founded Starfish International, which helps African AIDs victims.  Hauer likes to give back,,  H e can spend a few years living on a house boat, and has been known to be a \"clean freak:. He got involved in this movie because he felt government was far to involved in our lives. They were even measuring the time it took to shower (like in Hawaii or Texas!!!) Anyway, WEDLOCK refers to  collars placed around prisoners necks so they do not escape- or they get electrocuted.  Its a movie well worth watching.  And any interview with Hauer you can dig up at this point of his life is treasure,  If yu can get Soldiers of orange  or Kejitie Tiipel. you won th e  acting  library of awards,  Never once does Hauer fail to stay in character.  He is amazing.", "summary": "Buy this video.......it never lags for thrills or excitement.", "unixReviewTime": 1411516800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "08 6, 2014", "reviewerID": "AYKYBJ1XHBQ1U", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Homerun Blast", "reviewText": "What a great movie! Me and my wife watched this movie this afternoon. My wife liked it alot. I had tried to find this movie for quite awhile in the past, but I couldn't find it, Thanks Amazon! You sure have pleanty of good selections on movies. I am a happy customer!", "summary": "What a great movie!", "unixReviewTime": 1407283200}
{"overall": 3.0, "verified": false, "reviewTime": "07 19, 2014", "reviewerID": "A22RJE21ASWBDP", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Rejane Hinkle", "reviewText": "I enjoyed this movie the first time around better than after I bought it.", "summary": "Three Stars", "unixReviewTime": 1405728000}
{"overall": 5.0, "verified": true, "reviewTime": "07 9, 2014", "reviewerID": "ARJ7UXWJGAZK5", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Clifford I. Olson", "reviewText": "I've always liked the action in this movie!! Rutger Hauer is 1 of my favorite actors, especially in Ladyhawke!!", "summary": "Five Stars", "unixReviewTime": 1404864000}
{"overall": 2.0, "vote": "3", "verified": true, "reviewTime": "05 11, 2014", "reviewerID": "A209C4Y64SUUJB", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "Marie A. Meyer", "reviewText": "I understand that this wasn't that popular of a movie, and that it is old. But when I opened it the center piece that holds the DVD in the case was broke out, the disk was very scratched, the movie does play, but it skips and freezes in the middle of it. I was not happy with my purchase. I really wanted this movie though.", "summary": "Wedlock DVD", "unixReviewTime": 1399766400}
{"overall": 5.0, "verified": true, "reviewTime": "03 16, 2014", "reviewerID": "A18Z4PYBB9L9RY", "asin": "6302255848", "style": {"Format:": " DVD"}, "reviewerName": "rdkmco", "reviewText": "Completely goofy premise but you know that when you buy. Decent quality DVD and it is hard to find. Good to watch every few months, just because......", "summary": "You know what you are getting", "unixReviewTime": 1394928000}
{"overall": 5.0, "verified": true, "reviewTime": "09 18, 2016", "reviewerID": "A230EJX6FHBGHR", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Steven Kelley", "reviewText": "Good movie", "summary": "Five Stars", "unixReviewTime": 1474156800}
{"overall": 1.0, "verified": true, "reviewTime": "09 18, 2016", "reviewerID": "AAVN6PMIS1WHF", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Larry", "reviewText": "More liberal claptrap.", "summary": "One Star", "unixReviewTime": 1474156800}
{"overall": 5.0, "verified": false, "reviewTime": "09 11, 2016", "reviewerID": "A1K5QEV309ORYK", "asin": "6302256615", "style": {"Format:": " DVD"}, "reviewerName": "Bravo10", "reviewText": "This is the original and the best! The remake is dark, poorly acted, and just full of extreme action to get it over. Stay with the original!", "summary": "This is the original and the best! The remake is dark", "unixReviewTime": 1473552000}
{"overall": 4.0, "verified": true, "reviewTime": "09 8, 2016", "reviewerID": "A2QHAJWQUMICVO", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Derrick", "reviewText": "Classic.", "summary": "Four Stars", "unixReviewTime": 1473292800}
{"overall": 5.0, "vote": "5", "verified": false, "reviewTime": "02 25, 2008", "reviewerID": "A1DMTMYNUU6MB0", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Jonathan Greenlee", "reviewText": "This is a classic Sci-Fi move, the one that put \"Klaatu barada nikto\" into our vocabulary.\nRe-watching this movie reminds us that in 50 years nothing really has changed.  We still await (and yearn for) signs of intelligent life in the universe.", "summary": "A classic movie, and classic reminder that nothing has changed", "unixReviewTime": 1203897600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "02 8, 2008", "reviewerID": "A2K94EYLLIA5F6", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "John Boy", "reviewText": "ONE OF THE TOP 5 OF ALL MOVIES EVER MADE IN SCIENCE FICTION.\nTHIS MOVIE IS STILL  RELEVANT TODAY.\nDON'T LET BLACK AND WHITE KEEP YOU FROM WATCHING THIS CLASSIC MOVIE.\nMANY MOVIES HAVE BEEN INFLUENCED BY THIS STORY.", "summary": "The Day the Earth Stood Still", "unixReviewTime": 1202428800}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "12 31, 2007", "reviewerID": "A3AVJCB1ZD6ZY5", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "R. Kyle", "reviewText": "This black and white classic from 56 years ago tells as much about our society even now as the CGI and monkey cam films of our current day and age.\n\nKlaatu (Michael Rennie) came to Earth with a simple message.  Space travel makes the universe smaller and what one race does eventually harms everyone.  So, Earthlings be peaceful--or else.\n\nUnfortunately, a soldier too quick on his trigger finger shoots him just as his space ship landed on the mall in Washington, DC.  Klaatu escapes US military custody and goes out to evaluate humanity on his own.\n\n\"The Day the Earth Stood Still\" shows earthlings at our best and worst.  It's such a simple film, no color, very little in the way of effects, and yet the starkness has a strength and beauty we seldom depict in today's films.  Great message, great film.  I'm very glad to have the opportunity to see it.", "summary": "There must be security for all or no one is secure", "unixReviewTime": 1199059200}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 10, 2007", "reviewerID": "A3D6NK6W8SKB10", "asin": "6302168465", "style": {"Format:": " DVD"}, "reviewerName": "Eternally Dubious", "reviewText": "<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Fusion-Sizzle/dp/1424115531/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Fusion: Sizzle</a>\n\n\"The Day the Earth Stood Still\" has got to be one of the very best science fiction movies of all time. I have one in my favorite movie collection. I also see in the news today that they are doing a remake of this fantastic movie. And while I am sure it will be more than excellent, there's just something about this one that will remain with me for all time. I love it! Five stars! I'd give it ten, if I could.", "summary": "A movie for all time", "unixReviewTime": 1194652800}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "08 3, 2006", "reviewerID": "A3CE57YNGVWBQN", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Tom S.", "reviewText": "Barbara Hershey delivers that line (above) very early in THE STUNT MAN, and she is saying a great deal. She is the old lady who magically transforms into a beautiful young woman, the fantasy, the dream girl at the end of the rainbow. She is the reason we go to the movies.\n\nThis is a work of art about the creation of a work of art. The work in this case happens to be a movie, and--as with all great works of art--there is one obsessed, cruel, megalomaniacal genius at the helm. Eli Cross (Peter O'Toole) is the most vivid depiction of a Hollywood director ever captured on film. He is a true patriarch, playing father/lover/drill sergeant to his cast and crew, and they all love/hate/fear him for it. Anyone who's ever been near an actual film set can tell you how accurate the character is.\n\nBut what makes this film just about the last word on the subject is Richard Rush's brilliant blurring of fantasy and reality. That, after all, is the main occupation of those who toil in the \"Dream Factory\" of show biz. Note the many references to ALICE IN WONDERLAND. Steve Railsback (who is terrific) is Alice, and Eli and his mad crew are what he finds on the other side of the looking glass. He is running from bleak reality, straight into the arms of an instant family: father (O'Toole), uncle (the screenwriter played by Allen Goorwitz), brother (fellow stuntman Chuck Bail), and love interest (Hershey). And they all may be planning to kill him on camera, just to make their movie even better. Now, that's Wonderland--and that's Hollywood!\n\nFew films before or since this 1980 gem have given us such a true, terrifying, hilarious view of the process of manufacturing dreams. Truffaut's DAY FOR NIGHT is the only one I can think of that comes close. How tall is King Kong? As tall as we want him to be. If you love the movies, you'll love THE STUNT MAN.", "summary": "\"I *am* the movies!\"", "unixReviewTime": 1154563200}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "02 28, 2006", "reviewerID": "A3BG5AR5KE6QYG", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "William", "reviewText": "\"The Stuntman\" is one of those films that having watched it once your not totally sure what you just experienced. Having watched \"The Stuntman\" several times there are at least three plotline levels to this movie.\nFirst is a \"Rambo\" like Vietnam Viet on the run movie.\nSecond is a an World War 1 Antiwar Comedy.\nThird is Movie about Stunt work and Stuntmen.\nForth I'm still not positive what happened to \"Burt\" was he murdered or killed or did he escape to LA.\nFifth is a guided tour of \"Alice in Wonderland\" film within a film with in a film.\nWhat I mean by that is after multiple viewings you suddenly realize that the first three plotlines have blended into one plotline and your Point of View has becomes more distant. What the film \"is\" a unique look at filmaking magic that leaves you always questioning reality.\n\nDirector Richard Rush is making a film about making a BAD movie. So it is extremely differcult to differentiate between genius/chaos.\nChuck Bail is a God!\nSteve Railsback begins the film looking like Charlie Manson.\nHe cleans up well. Still he is an interesting choice as our hero. One keeps on expecting \"Charlie\" to kill everyone any minute\nBarbara Hershey is an actress we do not see enough in films.\nShe plays the neurotic actress rather well.\nPeter O'Toole portrayal of Eli Cross is outstanding nears but never goes over the top.\n\nBy the way King Kong the First was 18 inches tall!", "summary": "\"When you think you know what is going on, you really don't!\"", "unixReviewTime": 1141084800}
{"overall": 5.0, "verified": false, "reviewTime": "12 22, 2005", "reviewerID": "A2CW9IQAPFEYLM", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Bomojaz", "reviewText": "Interesting mix of reality vs. make believe (done up in a Hollywood blender, of course). A man (Steve Railsback), on the run from the police, wanders onto the set of a movie shoot and is witness to a stuntman's \"accidental\" death. Peter O'Toole, director of the movie, talks Railsback into performing the same stunt. Much of the film we're watching is a behind-the-scenes expose of what it's really like to do stunt work, as Railsback is prepared for the stunt.\n\nAs the time for the stunt nears (it involves driving a car off a bridge), Railsback begins to wonder if O'Toole really wants him killed in the stunt, thus getting rid of the only outside witness to the original \"accident.\" We really can't tell, either, and it's only after the stunt is completed (successfully) do we know. O'Toole is excellent, almost bigger than the movie itself; everyone else is just okay. It's a tad too long and drags in the middle section, but it's an excellent idea well done - especially at the end where clout is needed.", "summary": "How much can we trust our eyes?", "unixReviewTime": 1135209600}
{"overall": 4.0, "vote": "8", "verified": false, "reviewTime": "08 3, 2005", "reviewerID": "A30LMTLC9XVWKJ", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "Only-A-Child", "reviewText": "The original King Kong was 3'6\" and the central gimmick of The Stunt Man is blurring the distinction between reality and the illusion created by film. Steve Railsback (the main character) is on the run for a silly crime and finds his way to a beach resort. As he enters the resort a song begins playing on the soundtrack: 'Out of nowhere, out of darkness into light...and you watch and wonder where you belong, and the crowd it moves and takes you along....you ask yourself what good are your dreams, in a world where nothing is as it seems'. The song sums up the title character's situation and its melody will replay several times later in the film.\n\nHe joins a crowd watching the film production of a WWI battle sequence. The crowd politely applauds at the end of each take. Then during a new scene there are huge explosions and smoke obscures much of where the action is being staged. The onlookers (and we viewers) look on with horror as the smoke clears and reveals a beach saturated with blood and dismembered bodies. The onlookers scream, the director yells cut, and the stunt men pull themselves out of the sand unhurt. The crowd goes wild with applause, far more appreciative about being fooled by the 'fabricated reality' than they were by their glimpse behind the scenes of the movie-making action. And this is the structure with The Stunt Man, viewers (like those in the crowd) are supposed to be kept off balance by this movie within a movie.\n\nYet this is merely a device to advance the storyline, which involves a complex theme about paranoia and trust. Railsback likens his relationship with the movie company's director-Peter O'Toole, and by analogy everyone's situation at some point of their life, to an incident he witnessed in Viet Nam. Someone stepped on a 'Bouncing Betty Mine', an anti-personnel device that while triggered by a person's weight, does not actually detonate until the person steps off the device. At this point there is no choice but to remain standing on the mine, trusting that something will happen to favorably change the situation. Just as in life there are times in the 'free will vs destiny' interplay when there is nothing you can do but place your trust a higher authority. Like 'The Ninth Configuration' (a film made about the same time and highly recommended for those interested in this theme); an authority figure works to redeem someone in his care by teaching them to trust someone or something, even when everything screams for them to step off the mine.\n\nWhile The Stunt Man is an excellent movie, which tells a valuable story in an interesting multi-layered fashion; it is not really the masterpiece that Director Richard Rush and its biggest fans claim. A lot of effort was made to portray Eli Cross (the O'Toole character) as an omniscient 'Godlike' figure and a genius filmmaker; a necessary characterization if the film's theme is to be sold to the viewing audience. Unfortunately these efforts are largely undermined by the moronic nature of the film within the film. The artistic picture this eccentric genius is making is not even on the intellectual level of Laurel and Hardy's 'Flying Deuces', and it has about the same level of slapstick with none of the humor. So there is a major credibility disconnect. You have to sympathize with Wells as he had huge obstacles to overcome getting this film into production and he simply did not have the resources to stage a credible action-adventure tale. But a better approach would have been to stage small things well rather than grand things cheaply; so the painfully on-the-cheap production design is ultimately his fault.\n\nA director bent on misdirection has a huge arsenal for manufacturing illusion; look at the widely different techniques successfully employed in 'Pulp Fiction', 'The Sixth Sense', and 'State & Main' for viewer misdirection. It is easy because the viewer only knows what the director chooses to reveal, yet the director must be careful that the viewer does not feel cheated. As Roger Ebbert said, some of the stunts are staged so that they're not only deceiving to Railsback (as intended), but plainly impossible. And the stunts are sneaky, at one point Railsback is on a tower that's blown up in flames. There is no plausible way he could have escaped alive-but the movie merely cuts to another shot of him, without explaining his escape. A film that depends on deceiving us has got to play by its own rules. Deceiving the audience is the magic of movies, but they can't be cheated on particulars.\n\nOverall the degree of misdirection was rather spartan and not particularly clever (that darn low budget) , meaning that they did not begin to create the degree of suspense that was necessary.\n\nThat said there were some interesting little details to look for when watching this film: A tight two-shot of Railsback and O'Toole on the beach, they step onto a platform which turns out to be attached to an unseen crane and are lifted into the air, the actors do not betray that this is happening-their conversation continues as the background changes. O'Toole compares Railsback to Alice about to enter Wonderland, he asks him to close his eyes and then the scene cuts to a hairdresser telling Railsback to open his eyes and see his physical transformation. Watch for the many deep focal transitions (particularly at the dinner scene) and the literal framing (like a painting with a frame)of many shots-which is used to promote the everything is a fabricated illusion message. Watch for the piglets spilling out of the baby carriage during one of the battle scenes-another Alice element. Watch for the very inventive shot of Railsback looking into the rolled down car window, shot through the rolled up window on the other side, with Barbara Hershey's face reflected in the frame.\n\nThen again, what do I know? I'm only a child.", "summary": "How Tall Is King Kong?", "unixReviewTime": 1123027200}
{"overall": 5.0, "vote": "12", "verified": false, "reviewTime": "10 23, 2004", "reviewerID": "A3UI6CTFWL721L", "asin": "6302260973", "style": {"Format:": " DVD"}, "reviewerName": "S. Naimpally", "reviewText": "Peter O'Toole, Barbara Hershey and Steve Railsback are superb in this movie. Railsback is a Vietnam vet who accidently kills a copy and stumble upon a WW I movie being shot by O'Toole, who plays the director. After his stunt man is killed, O'Toole blackmails Railsback into becoming his stunt man, and Railsback thinks O'Toole is trying to kill him.\n\nBarbara Hershey as Railsback love interest looks gorgeous. O'Toole is amazing. Not your usual, predictable Hollywood plot. A very special movie worth owning for repeat viewing.", "summary": "Excellent acting, plot make for an engrossing film.", "unixReviewTime": 1098489600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "10 16, 2004", "reviewerID": "A33PECEQITGHIQ", "asin": "6302260973", "style": {"Format:": " VHS Tape"}, "reviewerName": "Erisu Kimu", "reviewText": "Aside from the great acting and brilliant concept, I didn't find too much to be WOWed about -- generally because it's an old movie and no matter how classical an old movie is, it's a bit blah for me, although I appreciate cult-classics which is why I gave this 5 stars. Peter O' Toole is a fascinatingly sadistic and yet intellectual director in the movie known as Eli Cross. Steve Railsback plays Cameron, a Vietnam veteran who is running away from the cops when he runs right onto a movie set and ends up avoiding a near-roadkill from one of the stuntmen. The stunt man ends up dying and Eli wants Steve to be his replacement, that way, it's also a solution for Eli to disguise himself from the cops. From there on, you see Cameron involved in a lot of stunts and movie shoots and the combination of action and comedy picks up. It gets quite interesting but the real power of the movie comes from Peter O' Toole's great performance, without him, I really don't know how good the movie would be regardless of how good the screenplay is. This movie was released the same year as Stanley Kubrick's \"The Shining\" and I'm not even sure if they can make another movie like it today. You should watch this movie at least once because it shows the complication of whether or not we're in reality or fantasy, whether or not things are real or fake and whether or not you're running away from the cops or being filmed. P.S -- No one on earth (I don't care who you are) should be called \"God.\" There's only one GOD and he's the man upstairs. Au Revoir!", "summary": "Appealing in its own way", "unixReviewTime": 1097884800}
{"overall": 5.0, "verified": true, "reviewTime": "04 27, 2012", "reviewerID": "AVDUZMUU6LO0W", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Larry D. Zmolik", "reviewText": "me and my wife have always loved the long long trailer and i remember seeing forever darling at the movies as a kid and it's great to watch them whenever you want along with too many girls. these are the only three movies they were in together.", "summary": "lucy & desi together", "unixReviewTime": 1335484800}
{"overall": 4.0, "verified": false, "reviewTime": "04 23, 2012", "reviewerID": "A3RQ1BBAA4II97", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Lady Laraine", "reviewText": "This is a great family film about the challenges of marriage--and we can learn alot of things from watching it.  It is different from most of the films and tv shows we've seen before with Lucille Ball and Desi Arnaz, because it has an almost spiritual aspect to it, which I liked and made me respect them as a couple even more.  Also, we don't see so much of the slapstick humor as we usually see with Lucy and Ricky.  Lucy plays an unusually rich socialite heir (Susan) who marries Lorenzo Vega (Larry) and discovers that being rich doesn't always offer answers to all our problems--especially in the area of marriage.  Susan's marriage is on the verge of disaster, because of lack of communication and constant pressure from her cousin, (played by Natalie Schafer--\"Gilligan's Island\"--\"Lovey Howell.\") Lorenzo, who is a scientist specializing in insecticides, understandably can't get along with Susan's cousin and her husband--who seem to be worst pests than his insecticides could ever go after.  Well, Prince Charming angel--in the angel-likeness of James Mason suddenly shows up, wishing to help mend the marriage--although Larry never seems to see him!  One of the funniest scenes is when Susan and Larry go to the movies and there, voila!, is James Mason starring in the film!  Susan imagines herself to be in the film with him and really falls for him--which, of course, temporarily causes problems with her relationship with the angel.  When the angel finally explains his reason for coming to Susan, she is then able to think of some ways to help rescue her marriage from disaster with his help.  (By the way, I read once that Cary Grant was originally asked to play the angel in this movie, but declined.  This makes a little more sense and I think Cary Grant would have made a more exciting movie star angel--but I'm just as glad James Mason took the part--and I think stepped up to the challenge very well).  Also, I have to comment on Desi Arnaz's great talent for acting and comedic timing--as well as his musical genius--which I often think were underrated.\n  My young daughters love to watch this film with me and I like them to see it also over and over--hoping that they'll learn some tips about relationships from this movie.  They're only six, so they were a little afraid of the \"angel aspect,\" but once they got past that, they seemed to enjoy the film over and over.  And by the way, Lucy has never looked so gorgeous as she does in the beginning scene of this movie--in her breathtakingly beautiful wedding gown.", "summary": "Forever Darling", "unixReviewTime": 1335139200}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "01 18, 2012", "reviewerID": "A239PPUVV8O0U0", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Adam Reed", "reviewText": "Too Many Girls- This is probably one of the most BORING musical ever! The acting is OK. Out of three male leads, Arnaz is the best. The main lead is wooden and the other two, well I never laughed at any of the jokes but they were amusing at best. Lucille Ball is alright but it's nothing to write home about. It does prove however that she can do serious moments compared to what she does later. The rest of the cast is just there, they don't do much of anything. I've heard complaints that shows that depict high school age people (Mighty Morphin' Power Rangers, Glee, etc.) don't get actors that resemble that age range but this is a young, romantic college musical and no one resembles any college age person I've ever seen. Maybe some people were around that age but I had a hard time believing any of these people were twentysomething. The songs are forgettable. I've seen this movie about three times and I don't remember any of them. And none of them make any sense in the context of the musical except for maybe Love Never Went To College. Desi pays the school's $300 fine, so let's sing a song about cakewalking or cake or whatever. Another reason why I didn't like the music is something that I don't like about a lot of musicals made around that time and that is every single person sings and sounds the same (except Desi)! I also don't like the fact that they dubbed Lucy. In certain episodes of I Love Lucy (I can't recall which), you can clearly hear her singing and she's not that bad (and wasn't she in a Broadway play around the early sixties after I Love Lucy ended?) The dancing however is pretty good such as the guy tap dancing during the Spic and Spanish number and the big finale. This will be one that I'll see once in blue moon. 2 stars.", "summary": "2 Out of 3 Ain't Bad", "unixReviewTime": 1326844800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "06 12, 2011", "reviewerID": "A2Q5Y2EMS6KDWI", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Randy E. Halford", "reviewText": "Following the box-office success of their \"Long, Long Trailer\" film, Lucille Ball & Desi Arnaz gave it one more try: 1956's \"Forever Darling\", a more grounded suburban comedy for the duo. This time around, however, there's no \"prop\" like a 40-foot trailer to push the story; if anything, just a \"fantasy\" gimmick. Again, the story begins with Lucy & Desi as newlyweds, with an amusing montage about what happens when the marriage becomes more \"common\" as the morning \"goodbye\" disintegrates from a passionate kiss to a quick peck on the cheek. After a few years, the marriage is on the rocks as the couple bicker---and not helped at all by meddling friends (one of which is Natalie Schaffer, \"Mrs. Howell\" from TV's \"Gilligan's Island\" fame). Then, Lucy believes she is \"losing her mind\" when an apparition--an angel taking the form of her favorite \"fantasy man\", James Mason--appears to tell her that the marriage is in dire peril, and that something must be done to save it.\nThe first three-quarters of the film is mostly dialogue-driven, allowing minimal physical comedy. The best is saved for last as the movie opens up for broader situation comedy during a funny & disastrous camping trip climax. Desi is surprisingly effective in the role of a pesticide chemist. And Lucy does what she does best: Fumbling through situations, reacting with those wide blue eyes, and showing her natural gift for physical comedy. Her reactions when watching (and eventually, \"dreaming\" herself into) the movie at the theatre while swooning over Mason are hysterical. The camping trip has too many funny moments to recount.\nAnother good example why Lucy & Desi were the reigning \"king & queen of situation comedy\" of the 50's!", "summary": "A surprisingly good comedy from Lucy & Desi", "unixReviewTime": 1307836800}
{"overall": 4.0, "vote": "5", "verified": true, "reviewTime": "03 28, 2011", "reviewerID": "A32GCOTGFJ9XC3", "asin": "6302241081", "style": {"Format:": " DVD"}, "reviewerName": "Alex H", "reviewText": "The three DVD box set, THE LUCY & DESI COLLECTION, offers fans of television's favorite red head and her Latin husband, the only three movies that they starred in together.\n\nYou get \"Too Many Girls,\" the black and white movie where Lucille Ball met Desi Arnaz and two color films, \"The Long, Long Trailer\" and \"Forever, Darling\" both of which were filmed during the height of their popularity on&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/I-Love-Lucy-The-Complete-Series/dp/B000TGJ8B2/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">I Love Lucy: The Complete Series</a>.\n\nAlthough it's difficult to separate Ball and Arnaz from their iconic roles as \"Lucy & Ricky Ricardo,\" it's still fun watching them ham it up for the camera. Like I said in the headline all that's missing is Vivian Vance and William Frawley as their trusted side-kicks, but fans of \"I Love Lucy\" will spot many of the supporting actors and actresses, plus extras, that appeared on the TV show in these films.\n\nThe quality is excellent, especially the two color films where fans get treated to seeing Lucy and Desi in color. In \"Forever, Darling,\" Ball sports some of the wardrobe she wears as \"Lucy Ricardo\" on TV, so fans get another feast seeing the fashions as they would've looked to a studio audience.\n\nTo top it off each DVD comes with extras, which I'm wondering if these were played in movie theaters back in the day, either during intermission or before the start of the movie, so it gives today's audience a glimpse of the past:\n\n* TOO MANY GIRLS * EXTRAS\nFrances Caroll & The Coquettes - 09:16-minutes -- fabulous all-female swing band that really play up a storm!\n\nCartoon: Shop, Look & Listen - 07:56 -- mice take a tour of a closed department store.\n\n* THE LONG, LONG TRAILER * EXTRAS\nAin't It Aggravatin? - 08:19-minutes -- short film showing the funny situations that happen in life that can get on one's nerves.\n\nCartoon: Dixieland Droopy - 07:44 -- shows the famous cartoon dog and his Dixie band, \"Pee-Wee Runt Dixieland Band\" which are fleas.\n\nTrailer.\n\n* FOREVER, DARLING * EXTRAS\nPromo Interview - 04:57-minutes -- Black & White interview of Lucy and Desi with clip from the film.\n\nTrailer.\n\nDefinitely buy the set if it's under $25 and you can't get enough Lucy!", "summary": "All That's Missing Are The *Mertzes*, But \"Lucy\" Fans Will Enjoy!", "unixReviewTime": 1301270400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "09 2, 2016", "reviewerID": "A2O8D5AMI8B1GZ", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Zac", "reviewText": "Fantastic movie. Had to buy it after watching the awful \"remake\" to make things right again. This is a great movie.", "summary": "Great", "unixReviewTime": 1472774400}
{"overall": 5.0, "verified": true, "reviewTime": "08 27, 2016", "reviewerID": "ALIV200V2SWN6", "asin": "6302256615", "style": {"Format:": " Amazon Video"}, "reviewerName": "Augustine", "reviewText": "Cult Classic, well crafted. Must see.", "summary": "Five Stars", "unixReviewTime": 1472256000}
